[Killed] BlockStatement
lib/game-store.ts:24:58
 const STORAGE_KEY = "@gamebook/games";
 let clientIdSequence = 0;
 
-function createClientId(prefix: "game" | "note"): string {
-  clientIdSequence = (clientIdSequence + 1) % 1_000_000;
-  const ts = Date.now().toString(36);
-  const seq = clientIdSequence.toString(36).padStart(4, "0");
-  return `tmp_${prefix}_${ts}_${seq}`;
-}
+function createClientId(prefix: "game" | "note"): string {}
 
 const SEED_GAMES: Game[] = [
killedBy: useGames generates unique IDs even when Date.now returns same value
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Survived] ArithmeticOperator
lib/game-store.ts:25:23
 let clientIdSequence = 0;
 
 function createClientId(prefix: "game" | "note"): string {
-  clientIdSequence = (clientIdSequence + 1) % 1_000_000;
+  clientIdSequence = (clientIdSequence - 1) % 1_000_000;
   const ts = Date.now().toString(36);
   const seq = clientIdSequence.toString(36).padStart(4, "0");

[Survived] ArithmeticOperator
lib/game-store.ts:25:22
 let clientIdSequence = 0;
 
 function createClientId(prefix: "game" | "note"): string {
-  clientIdSequence = (clientIdSequence + 1) % 1_000_000;
+  clientIdSequence = (clientIdSequence + 1) * 1_000_000;
   const ts = Date.now().toString(36);
   const seq = clientIdSequence.toString(36).padStart(4, "0");

[Survived] StringLiteral
lib/game-store.ts:27:57
 function createClientId(prefix: "game" | "note"): string {
   clientIdSequence = (clientIdSequence + 1) % 1_000_000;
   const ts = Date.now().toString(36);
-  const seq = clientIdSequence.toString(36).padStart(4, "0");
+  const seq = clientIdSequence.toString(36).padStart(4, "");
   return `tmp_${prefix}_${ts}_${seq}`;
 }

[Killed] ConditionalExpression
lib/game-store.ts:105:9
 async function loadGames(): Promise<Game[]> {
   try {
     const raw = await AsyncStorage.getItem(STORAGE_KEY);
-    if (raw) {
+    if (false) {
       const normalized = decodeStoredGames(raw);
       if (!normalized) {
killedBy: useGames loads games from storage when present
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 2

  Object {
-   "id": "g1",
+   "id": "seed-stardew",

[Survived] ConditionalExpression
lib/game-store.ts:105:9
 async function loadGames(): Promise<Game[]> {
   try {
     const raw = await AsyncStorage.getItem(STORAGE_KEY);
-    if (raw) {
+    if (true) {
       const normalized = decodeStoredGames(raw);
       if (!normalized) {

[Killed] ConditionalExpression
lib/game-store.ts:107:11
     const raw = await AsyncStorage.getItem(STORAGE_KEY);
     if (raw) {
       const normalized = decodeStoredGames(raw);
-      if (!normalized) {
+      if (true) {
         throw new Error("Invalid stored games payload");
       }
killedBy: useGames loads games from storage when present
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 2

  Object {
-   "id": "g1",
+   "id": "seed-stardew",

[Killed] BooleanLiteral
lib/game-store.ts:107:11
     const raw = await AsyncStorage.getItem(STORAGE_KEY);
     if (raw) {
       const normalized = decodeStoredGames(raw);
-      if (!normalized) {
+      if (normalized) {
         throw new Error("Invalid stored games payload");
       }
killedBy: useGames loads games from storage when present
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 2

  Object {
-   "id": "g1",
+   "id": "seed-stardew",

[Survived] StringLiteral
lib/game-store.ts:108:25
     if (raw) {
       const normalized = decodeStoredGames(raw);
       if (!normalized) {
-        throw new Error("Invalid stored games payload");
+        throw new Error("");
       }
       const needsSpanNormalization = normalized.some((game) => {

[Killed] BlockStatement
lib/game-store.ts:110:64
       if (!normalized) {
         throw new Error("Invalid stored games payload");
       }
-      const needsSpanNormalization = normalized.some((game) => {
-        if (!game.board) return false;
-        const constrained = constrainSpanForCard(
-          game.ticketType,
-          { w: game.board.w, h: game.board.h },
-          DEFAULT_BOARD_COLUMNS
-        );
-        return constrained.w !== game.board.w || constrained.h !== game.board.h;
-      });
+      const needsSpanNormalization = normalized.some((game) => {});
       const needsLayoutMigration = normalized.some(
         (game) =>
killedBy: useGames normalizes legacy invalid spans on load
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
-   "h": 2,

[Survived] MethodExpression
lib/game-store.ts:110:38
       if (!normalized) {
         throw new Error("Invalid stored games payload");
       }
-      const needsSpanNormalization = normalized.some((game) => {
-        if (!game.board) return false;
-        const constrained = constrainSpanForCard(
-          game.ticketType,
-          { w: game.board.w, h: game.board.h },
-          DEFAULT_BOARD_COLUMNS
-        );
-        return constrained.w !== game.board.w || constrained.h !== game.board.h;
-      });
+      const needsSpanNormalization = normalized.every(game => {
+  if (!game.board) return false;
+  const constrained = constrainSpanForCard(game.ticketType, {
+    w: game.board.w,
+    h: game.board.h
+  }, DEFAULT_BOARD_COLUMNS);
+  return constrained.w !== game.board.w || constrained.h !== game.board.h;
+});
       const needsLayoutMigration = normalized.some(
         (game) =>

[Killed] ConditionalExpression
lib/game-store.ts:111:13
         throw new Error("Invalid stored games payload");
       }
       const needsSpanNormalization = normalized.some((game) => {
-        if (!game.board) return false;
+        if (false) return false;
         const constrained = constrainSpanForCard(
           game.ticketType,
killedBy: useGames loads games from storage when present
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 2

  Object {
-   "id": "g1",
+   "id": "seed-stardew",

[Killed] BooleanLiteral
lib/game-store.ts:111:13
         throw new Error("Invalid stored games payload");
       }
       const needsSpanNormalization = normalized.some((game) => {
-        if (!game.board) return false;
+        if (game.board) return false;
         const constrained = constrainSpanForCard(
           game.ticketType,
killedBy: useGames loads games from storage when present
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 2

  Object {
-   "id": "g1",
+   "id": "seed-stardew",

[Killed] ConditionalExpression
lib/game-store.ts:117:16
           { w: game.board.w, h: game.board.h },
           DEFAULT_BOARD_COLUMNS
         );
-        return constrained.w !== game.board.w || constrained.h !== game.board.h;
+        return false;
       });
       const needsLayoutMigration = normalized.some(
killedBy: useGames normalizes legacy invalid spans on load
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
-   "h": 2,

[Survived] EqualityOperator
lib/game-store.ts:117:16
           { w: game.board.w, h: game.board.h },
           DEFAULT_BOARD_COLUMNS
         );
-        return constrained.w !== game.board.w || constrained.h !== game.board.h;
+        return constrained.w === game.board.w || constrained.h !== game.board.h;
       });
       const needsLayoutMigration = normalized.some(

[Killed] ConditionalExpression
lib/game-store.ts:119:36
         );
         return constrained.w !== game.board.w || constrained.h !== game.board.h;
       });
-      const needsLayoutMigration = normalized.some(
-        (game) =>
-          !game.board ||
-          game.board.columns !== DEFAULT_BOARD_COLUMNS
-      ) || needsSpanNormalization;
+      const needsLayoutMigration = false;
       const withLayout = needsLayoutMigration
         ? applyBoardLayout(normalized, DEFAULT_BOARD_COLUMNS)
killedBy: useGames normalizes legacy invalid spans on load
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
-   "h": 2,

[Killed] LogicalOperator
lib/game-store.ts:119:36
         );
         return constrained.w !== game.board.w || constrained.h !== game.board.h;
       });
-      const needsLayoutMigration = normalized.some(
-        (game) =>
-          !game.board ||
-          game.board.columns !== DEFAULT_BOARD_COLUMNS
-      ) || needsSpanNormalization;
+      const needsLayoutMigration = normalized.some(game => !game.board || game.board.columns !== DEFAULT_BOARD_COLUMNS) && needsSpanNormalization;
       const withLayout = needsLayoutMigration
         ? applyBoardLayout(normalized, DEFAULT_BOARD_COLUMNS)
killedBy: useGames normalizes legacy invalid spans on load
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
-   "h": 2,

[Survived] ArrowFunction
lib/game-store.ts:120:9
         return constrained.w !== game.board.w || constrained.h !== game.board.h;
       });
       const needsLayoutMigration = normalized.some(
-        (game) =>
-          !game.board ||
-          game.board.columns !== DEFAULT_BOARD_COLUMNS
+        () => undefined
       ) || needsSpanNormalization;
       const withLayout = needsLayoutMigration

[Killed] BooleanLiteral
lib/game-store.ts:121:11
       });
       const needsLayoutMigration = normalized.some(
         (game) =>
-          !game.board ||
+          game.board ||
           game.board.columns !== DEFAULT_BOARD_COLUMNS
       ) || needsSpanNormalization;
killedBy: useGames loads games from storage when present
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 2

  Object {
-   "id": "g1",
+   "id": "seed-stardew",

[Killed] LogicalOperator
lib/game-store.ts:121:11
       });
       const needsLayoutMigration = normalized.some(
         (game) =>
-          !game.board ||
-          game.board.columns !== DEFAULT_BOARD_COLUMNS
+          !game.board && game.board.columns !== DEFAULT_BOARD_COLUMNS
       ) || needsSpanNormalization;
       const withLayout = needsLayoutMigration
killedBy: useGames loads games from storage when present
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 3
+ Received  + 2

  Object {
-   "id": "g1",
+   "id": "seed-stardew",

[Survived] EqualityOperator
lib/game-store.ts:122:11
       const needsLayoutMigration = normalized.some(
         (game) =>
           !game.board ||
-          game.board.columns !== DEFAULT_BOARD_COLUMNS
+          game.board.columns === DEFAULT_BOARD_COLUMNS
       ) || needsSpanNormalization;
       const withLayout = needsLayoutMigration

[Survived] ConditionalExpression
lib/game-store.ts:122:11
       const needsLayoutMigration = normalized.some(
         (game) =>
           !game.board ||
-          game.board.columns !== DEFAULT_BOARD_COLUMNS
+          false
       ) || needsSpanNormalization;
       const withLayout = needsLayoutMigration

[Killed] ConditionalExpression
lib/game-store.ts:127:11
       const withLayout = needsLayoutMigration
         ? applyBoardLayout(normalized, DEFAULT_BOARD_COLUMNS)
         : normalized;
-      if (needsLayoutMigration) {
+      if (false) {
         await persistGames(withLayout);
       }
killedBy: useGames normalizes legacy invalid spans on load
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
lib/game-store.ts:127:33
       const withLayout = needsLayoutMigration
         ? applyBoardLayout(normalized, DEFAULT_BOARD_COLUMNS)
         : normalized;
-      if (needsLayoutMigration) {
-        await persistGames(withLayout);
-      }
+      if (needsLayoutMigration) {}
       return withLayout;
     }
killedBy: useGames normalizes legacy invalid spans on load
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
lib/game-store.ts:140:59
   return seeded;
 }
 
-async function persistGames(games: Game[]): Promise<void> {
-  await AsyncStorage.setItem(STORAGE_KEY, JSON.stringify(games));
-}
+async function persistGames(games: Game[]): Promise<void> {}
 
 export function useGames() {
killedBy: useGames saveNote persists a new note
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BooleanLiteral
lib/game-store.ts:146:42
 
 export function useGames() {
   const [games, setGames] = useState<Game[]>([]);
-  const [loading, setLoading] = useState(true);
+  const [loading, setLoading] = useState(false);
 
   const setGamesWithPersistence = useCallback(
killedBy: useGames seeds default games when storage is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: true
Received: false

[Killed] BlockStatement
lib/game-store.ts:149:43
   const [loading, setLoading] = useState(true);
 
   const setGamesWithPersistence = useCallback(
-    (update: (prev: Game[]) => Game[]) => {
-      setGames((prev) => {
-        const next = update(prev);
-        if (next !== prev) {
-          void persistGames(next);
-        }
-        return next;
-      });
-    },
+    (update: (prev: Game[]) => Game[]) => {},
     []
   );
killedBy: useGames saveNote persists a new note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "At the castle"
Received: undefined

[Killed] BlockStatement
lib/game-store.ts:150:26
 
   const setGamesWithPersistence = useCallback(
     (update: (prev: Game[]) => Game[]) => {
-      setGames((prev) => {
-        const next = update(prev);
-        if (next !== prev) {
-          void persistGames(next);
-        }
-        return next;
-      });
+      setGames((prev) => {});
     },
     []
killedBy: useGames saveNote persists a new note
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[Killed] ConditionalExpression
lib/game-store.ts:152:13
     (update: (prev: Game[]) => Game[]) => {
       setGames((prev) => {
         const next = update(prev);
-        if (next !== prev) {
+        if (false) {
           void persistGames(next);
         }
killedBy: useGames addGameWithInitialNote creates game with status playing and seeds first note
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
lib/game-store.ts:152:28
     (update: (prev: Game[]) => Game[]) => {
       setGames((prev) => {
         const next = update(prev);
-        if (next !== prev) {
-          void persistGames(next);
-        }
+        if (next !== prev) {}
         return next;
       });
killedBy: useGames addGameWithInitialNote creates game with status playing and seeds first note
statusReason: Error: expect(jest.fn()).toHaveBeenCalled()

Expected number of calls: >= 1
Received number of calls:    0

[Killed] BlockStatement
lib/game-store.ts:161:19
     []
   );
 
-  useEffect(() => {
-    loadGames().then((loaded) => {
-      setGames(loaded);
-      setLoading(false);
-    });
-  }, []);
+  useEffect(() => {}, []);
 
   const playingGames = games.filter((g) => g.status === "playing");
killedBy: useGames seeds default games when storage is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BlockStatement
lib/game-store.ts:162:34
   );
 
   useEffect(() => {
-    loadGames().then((loaded) => {
-      setGames(loaded);
-      setLoading(false);
-    });
+    loadGames().then((loaded) => {});
   }, []);
 
killedBy: useGames seeds default games when storage is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] BooleanLiteral
lib/game-store.ts:164:18
   useEffect(() => {
     loadGames().then((loaded) => {
       setGames(loaded);
-      setLoading(false);
+      setLoading(true);
     });
   }, []);
killedBy: useGames seeds default games when storage is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: false
Received: true

[Killed] ConditionalExpression
lib/game-store.ts:168:44
     });
   }, []);
 
-  const playingGames = games.filter((g) => g.status === "playing");
+  const playingGames = games.filter((g) => true);
 
   const saveNote = useCallback(
killedBy: useGames filters playingGames by status
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ArrowFunction
lib/game-store.ts:168:37
     });
   }, []);
 
-  const playingGames = games.filter((g) => g.status === "playing");
+  const playingGames = games.filter(() => undefined);
 
   const saveNote = useCallback(
killedBy: useGames seeds default games when storage is empty
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 5
Received: 0

[Killed] BlockStatement
lib/game-store.ts:174:25
     async (
       gameId: string,
       note: Omit<GameNote, "id" | "timestamp">
-    ): Promise<void> => {
-      setGamesWithPersistence((prev) => {
-        const next = prev.map((g) => {
-          if (g.id !== gameId) return g;
-          const ts = Date.now();
-          const newNote: GameNote = {
-            ...note,
-            id: createClientId("note"),
-            timestamp: ts,
-          };
-          return {
-            ...g,
-            lastNote: newNote,
-            notes: [newNote, ...g.notes],
-          };
-        });
-        return next;
-      });
-    },
+    ): Promise<void> => {},
     [setGamesWithPersistence]
   );
killedBy: useGames saveNote persists a new note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "At the castle"
Received: undefined

[Killed] BlockStatement
lib/game-store.ts:175:41
       gameId: string,
       note: Omit<GameNote, "id" | "timestamp">
     ): Promise<void> => {
-      setGamesWithPersistence((prev) => {
-        const next = prev.map((g) => {
-          if (g.id !== gameId) return g;
-          const ts = Date.now();
-          const newNote: GameNote = {
-            ...note,
-            id: createClientId("note"),
-            timestamp: ts,
-          };
-          return {
-            ...g,
-            lastNote: newNote,
-            notes: [newNote, ...g.notes],
-          };
-        });
-        return next;
-      });
+      setGamesWithPersistence((prev) => {});
     },
     [setGamesWithPersistence]
killedBy: useGames saveNote persists a new note
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[Killed] BlockStatement
lib/game-store.ts:176:38
       note: Omit<GameNote, "id" | "timestamp">
     ): Promise<void> => {
       setGamesWithPersistence((prev) => {
-        const next = prev.map((g) => {
-          if (g.id !== gameId) return g;
-          const ts = Date.now();
-          const newNote: GameNote = {
-            ...note,
-            id: createClientId("note"),
-            timestamp: ts,
-          };
-          return {
-            ...g,
-            lastNote: newNote,
-            notes: [newNote, ...g.notes],
-          };
-        });
+        const next = prev.map((g) => {});
         return next;
       });
killedBy: useGames saveNote persists a new note
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] EqualityOperator
lib/game-store.ts:177:15
     ): Promise<void> => {
       setGamesWithPersistence((prev) => {
         const next = prev.map((g) => {
-          if (g.id !== gameId) return g;
+          if (g.id === gameId) return g;
           const ts = Date.now();
           const newNote: GameNote = {
killedBy: useGames saveNote persists a new note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "At the castle"
Received: undefined

[Killed] ConditionalExpression
lib/game-store.ts:177:15
     ): Promise<void> => {
       setGamesWithPersistence((prev) => {
         const next = prev.map((g) => {
-          if (g.id !== gameId) return g;
+          if (true) return g;
           const ts = Date.now();
           const newNote: GameNote = {
killedBy: useGames saveNote persists a new note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "At the castle"
Received: undefined

[Survived] StringLiteral
lib/game-store.ts:181:32
           const ts = Date.now();
           const newNote: GameNote = {
             ...note,
-            id: createClientId("note"),
+            id: createClientId(""),
             timestamp: ts,
           };

[Killed] ObjectLiteral
lib/game-store.ts:184:18
             id: createClientId("note"),
             timestamp: ts,
           };
-          return {
-            ...g,
-            lastNote: newNote,
-            notes: [newNote, ...g.notes],
-          };
+          return {};
         });
         return next;
killedBy: useGames saveNote persists a new note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "At the castle"
Received: undefined

[Killed] ArrayDeclaration
lib/game-store.ts:187:20
           return {
             ...g,
             lastNote: newNote,
-            notes: [newNote, ...g.notes],
+            notes: [],
           };
         });
killedBy: useGames saveNote persists a new note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ObjectLiteral
lib/game-store.ts:208:33
       const ts = Date.now();
       const noteId = createClientId("note");
       const gameId = createClientId("game");
-      const newNote: GameNote = {
-        id: noteId,
-        timestamp: ts,
-        whereLeftOff: input.whereLeftOff.trim(),
-        quickThought: input.quickThought?.trim() || undefined,
-      };
+      const newNote: GameNote = {};
       const newGame: Game = {
         id: gameId,
killedBy: useGames addGameWithInitialNote creates game with status playing and seeds first note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Just started"
Received: undefined

[Survived] MethodExpression
lib/game-store.ts:211:23
       const newNote: GameNote = {
         id: noteId,
         timestamp: ts,
-        whereLeftOff: input.whereLeftOff.trim(),
+        whereLeftOff: input.whereLeftOff,
         quickThought: input.quickThought?.trim() || undefined,
       };

[Killed] LogicalOperator
lib/game-store.ts:212:23
         id: noteId,
         timestamp: ts,
         whereLeftOff: input.whereLeftOff.trim(),
-        quickThought: input.quickThought?.trim() || undefined,
+        quickThought: input.quickThought?.trim() && undefined,
       };
       const newGame: Game = {
killedBy: useGames addGameWithInitialNote creates game with status playing and seeds first note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Excited"
Received: undefined

[Killed] OptionalChaining
lib/game-store.ts:212:23
         id: noteId,
         timestamp: ts,
         whereLeftOff: input.whereLeftOff.trim(),
-        quickThought: input.quickThought?.trim() || undefined,
+        quickThought: input.quickThought.trim() || undefined,
       };
       const newGame: Game = {
killedBy: useGames addGameWithInitialNote persists to AsyncStorage
statusReason: TypeError: Cannot read properties of undefined (reading 'trim')

[Killed] ObjectLiteral
lib/game-store.ts:214:29
         whereLeftOff: input.whereLeftOff.trim(),
         quickThought: input.quickThought?.trim() || undefined,
       };
-      const newGame: Game = {
-        id: gameId,
-        title: input.title.trim(),
-        ticketType: input.ticketType ?? DEFAULT_TICKET_TYPE,
-        mountStyle: input.mountStyle ?? DEFAULT_CARD_MOUNT_STYLE,
-        postcardSide: input.postcardSide ?? DEFAULT_POSTCARD_SIDE,
-        status: "playing",
-        lastNote: newNote,
-        notes: [newNote],
-      };
+      const newGame: Game = {};
       let createdGame: Game = newGame;
       setGamesWithPersistence((prev) => {
killedBy: useGames addGameWithInitialNote creates game with status playing and seeds first note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "New Game"
Received: undefined

[Survived] MethodExpression
lib/game-store.ts:216:16
       };
       const newGame: Game = {
         id: gameId,
-        title: input.title.trim(),
+        title: input.title,
         ticketType: input.ticketType ?? DEFAULT_TICKET_TYPE,
         mountStyle: input.mountStyle ?? DEFAULT_CARD_MOUNT_STYLE,

[Killed] LogicalOperator
lib/game-store.ts:217:21
       const newGame: Game = {
         id: gameId,
         title: input.title.trim(),
-        ticketType: input.ticketType ?? DEFAULT_TICKET_TYPE,
+        ticketType: input.ticketType && DEFAULT_TICKET_TYPE,
         mountStyle: input.mountStyle ?? DEFAULT_CARD_MOUNT_STYLE,
         postcardSide: input.postcardSide ?? DEFAULT_POSTCARD_SIDE,
killedBy: useGames addGameWithInitialNote creates game with status playing and seeds first note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "polaroid"
Received: undefined

[Killed] LogicalOperator
lib/game-store.ts:218:21
         id: gameId,
         title: input.title.trim(),
         ticketType: input.ticketType ?? DEFAULT_TICKET_TYPE,
-        mountStyle: input.mountStyle ?? DEFAULT_CARD_MOUNT_STYLE,
+        mountStyle: input.mountStyle && DEFAULT_CARD_MOUNT_STYLE,
         postcardSide: input.postcardSide ?? DEFAULT_POSTCARD_SIDE,
         status: "playing",
killedBy: useGames addGameWithInitialNote creates game with status playing and seeds first note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "tape"
Received: undefined

[Killed] LogicalOperator
lib/game-store.ts:219:23
         title: input.title.trim(),
         ticketType: input.ticketType ?? DEFAULT_TICKET_TYPE,
         mountStyle: input.mountStyle ?? DEFAULT_CARD_MOUNT_STYLE,
-        postcardSide: input.postcardSide ?? DEFAULT_POSTCARD_SIDE,
+        postcardSide: input.postcardSide && DEFAULT_POSTCARD_SIDE,
         status: "playing",
         lastNote: newNote,
killedBy: useGames addGameWithInitialNote creates game with status playing and seeds first note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "front"
Received: undefined

[Killed] BlockStatement
lib/game-store.ts:225:41
         notes: [newNote],
       };
       let createdGame: Game = newGame;
-      setGamesWithPersistence((prev) => {
-        const next = applyBoardLayout(
-          [newGame, ...prev],
-          DEFAULT_BOARD_COLUMNS
-        );
-        createdGame = next[0];
-        return next;
-      });
+      setGamesWithPersistence((prev) => {});
       return createdGame;
     },
killedBy: useGames addGameWithInitialNote creates game with status playing and seeds first note
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[Killed] ArrayDeclaration
lib/game-store.ts:227:11
       let createdGame: Game = newGame;
       setGamesWithPersistence((prev) => {
         const next = applyBoardLayout(
-          [newGame, ...prev],
+          [],
           DEFAULT_BOARD_COLUMNS
         );
killedBy: useGames addGameWithInitialNote creates game with status playing and seeds first note
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] BlockStatement
lib/game-store.ts:239:69
   );
 
   const saveBoardPlacement = useCallback(
-    async (gameId: string, board: BoardPlacement): Promise<void> => {
-      setGamesWithPersistence((prev) => {
-        const next = prev.map((game) =>
-          game.id === gameId ? { ...game, board } : game
-        );
-        return next;
-      });
-    },
+    async (gameId: string, board: BoardPlacement): Promise<void> => {},
     [setGamesWithPersistence]
   );
killedBy: useGames saveBoardPlacement persists explicit board coordinates
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
    "h": 2,

[Killed] BlockStatement
lib/game-store.ts:240:41
 
   const saveBoardPlacement = useCallback(
     async (gameId: string, board: BoardPlacement): Promise<void> => {
-      setGamesWithPersistence((prev) => {
-        const next = prev.map((game) =>
-          game.id === gameId ? { ...game, board } : game
-        );
-        return next;
-      });
+      setGamesWithPersistence((prev) => {});
     },
     [setGamesWithPersistence]
killedBy: useGames saveBoardPlacement persists explicit board coordinates
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[Killed] ArrowFunction
lib/game-store.ts:241:31
   const saveBoardPlacement = useCallback(
     async (gameId: string, board: BoardPlacement): Promise<void> => {
       setGamesWithPersistence((prev) => {
-        const next = prev.map((game) =>
-          game.id === gameId ? { ...game, board } : game
+        const next = prev.map(() => undefined
         );
         return next;
killedBy: useGames saveBoardPlacement persists explicit board coordinates
statusReason: TypeError: Cannot read properties of undefined (reading 'status')
