[Killed] EqualityOperator
lib/game-store.ts:242:11
     async (gameId: string, board: BoardPlacement): Promise<void> => {
       setGamesWithPersistence((prev) => {
         const next = prev.map((game) =>
-          game.id === gameId ? { ...game, board } : game
+          game.id !== gameId ? { ...game, board } : game
         );
         return next;
killedBy: useGames saveBoardPlacement persists explicit board coordinates
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
    "h": 2,

[Killed] ConditionalExpression
lib/game-store.ts:242:11
     async (gameId: string, board: BoardPlacement): Promise<void> => {
       setGamesWithPersistence((prev) => {
         const next = prev.map((game) =>
-          game.id === gameId ? { ...game, board } : game
+          false ? { ...game, board } : game
         );
         return next;
killedBy: useGames saveBoardPlacement persists explicit board coordinates
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
    "h": 2,

[Killed] BlockStatement
lib/game-store.ts:256:25
       toIndex: number,
       columns: number = DEFAULT_BOARD_COLUMNS,
       spanOverride?: { w: number; h: number }
-    ): Promise<void> => {
-      setGamesWithPersistence((prev) => {
-        const fromIndex = prev.findIndex((game) => game.id === gameId);
-        if (fromIndex === -1) return prev;
-        const ordered = [...prev];
-        const [moved] = ordered.splice(fromIndex, 1);
-        const movedWithSpan = spanOverride
-          ? {
-              ...moved,
-              board: {
-                ...(moved.board ?? { x: 0, y: 0, columns }),
-                w: spanOverride.w,
-                h: spanOverride.h,
-                columns,
-              },
-            }
-          : moved;
-        const clampedIndex = Math.max(0, Math.min(toIndex, ordered.length));
-        ordered.splice(clampedIndex, 0, movedWithSpan);
-        const next = applyBoardLayout(ordered, columns);
-        return next;
-      });
-    },
+    ): Promise<void> => {},
     [setGamesWithPersistence]
   );
killedBy: useGames reorderGame inserts card at target index and reapplies layout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g2"
Received: "g1"

[Killed] BlockStatement
lib/game-store.ts:257:41
       columns: number = DEFAULT_BOARD_COLUMNS,
       spanOverride?: { w: number; h: number }
     ): Promise<void> => {
-      setGamesWithPersistence((prev) => {
-        const fromIndex = prev.findIndex((game) => game.id === gameId);
-        if (fromIndex === -1) return prev;
-        const ordered = [...prev];
-        const [moved] = ordered.splice(fromIndex, 1);
-        const movedWithSpan = spanOverride
-          ? {
-              ...moved,
-              board: {
-                ...(moved.board ?? { x: 0, y: 0, columns }),
-                w: spanOverride.w,
-                h: spanOverride.h,
-                columns,
-              },
-            }
-          : moved;
-        const clampedIndex = Math.max(0, Math.min(toIndex, ordered.length));
-        ordered.splice(clampedIndex, 0, movedWithSpan);
-        const next = applyBoardLayout(ordered, columns);
-        return next;
-      });
+      setGamesWithPersistence((prev) => {});
     },
     [setGamesWithPersistence]
killedBy: useGames reorderGame inserts card at target index and reapplies layout
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[Killed] ConditionalExpression
lib/game-store.ts:258:52
       spanOverride?: { w: number; h: number }
     ): Promise<void> => {
       setGamesWithPersistence((prev) => {
-        const fromIndex = prev.findIndex((game) => game.id === gameId);
+        const fromIndex = prev.findIndex((game) => false);
         if (fromIndex === -1) return prev;
         const ordered = [...prev];
killedBy: useGames reorderGame inserts card at target index and reapplies layout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g2"
Received: "g1"

[Killed] ConditionalExpression
lib/game-store.ts:258:52
       spanOverride?: { w: number; h: number }
     ): Promise<void> => {
       setGamesWithPersistence((prev) => {
-        const fromIndex = prev.findIndex((game) => game.id === gameId);
+        const fromIndex = prev.findIndex((game) => true);
         if (fromIndex === -1) return prev;
         const ordered = [...prev];
killedBy: useGames reorderGame inserts card at target index and reapplies layout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g2"
Received: "g1"

[Killed] UnaryOperator
lib/game-store.ts:259:27
     ): Promise<void> => {
       setGamesWithPersistence((prev) => {
         const fromIndex = prev.findIndex((game) => game.id === gameId);
-        if (fromIndex === -1) return prev;
+        if (fromIndex === +1) return prev;
         const ordered = [...prev];
         const [moved] = ordered.splice(fromIndex, 1);
killedBy: useGames reorderGame inserts card at target index and reapplies layout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g2"
Received: "g1"

[Killed] EqualityOperator
lib/game-store.ts:259:13
     ): Promise<void> => {
       setGamesWithPersistence((prev) => {
         const fromIndex = prev.findIndex((game) => game.id === gameId);
-        if (fromIndex === -1) return prev;
+        if (fromIndex !== -1) return prev;
         const ordered = [...prev];
         const [moved] = ordered.splice(fromIndex, 1);
killedBy: useGames reorderGame inserts card at target index and reapplies layout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g2"
Received: "g1"

[Killed] ArrayDeclaration
lib/game-store.ts:260:25
       setGamesWithPersistence((prev) => {
         const fromIndex = prev.findIndex((game) => game.id === gameId);
         if (fromIndex === -1) return prev;
-        const ordered = [...prev];
+        const ordered = [];
         const [moved] = ordered.splice(fromIndex, 1);
         const movedWithSpan = spanOverride
killedBy: useGames reorderGame inserts card at target index and reapplies layout
statusReason: TypeError: Cannot read properties of undefined (reading 'board')

[Killed] ObjectLiteral
lib/game-store.ts:265:22
         const movedWithSpan = spanOverride
           ? {
               ...moved,
-              board: {
-                ...(moved.board ?? { x: 0, y: 0, columns }),
-                w: spanOverride.w,
-                h: spanOverride.h,
-                columns,
-              },
+              board: {},
             }
           : moved;
killedBy: useGames reorderGame applies span override so moved card can occupy more slots
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
-   "h": 2,

[Survived] LogicalOperator
lib/game-store.ts:266:21
           ? {
               ...moved,
               board: {
-                ...(moved.board ?? { x: 0, y: 0, columns }),
+                ...(moved.board && {
+  x: 0,
+  y: 0,
+  columns
+}),
                 w: spanOverride.w,
                 h: spanOverride.h,

[Killed] MethodExpression
lib/game-store.ts:273:42
               },
             }
           : moved;
-        const clampedIndex = Math.max(0, Math.min(toIndex, ordered.length));
+        const clampedIndex = Math.max(0, Math.max(toIndex, ordered.length));
         ordered.splice(clampedIndex, 0, movedWithSpan);
         const next = applyBoardLayout(ordered, columns);
killedBy: useGames reorderGame inserts card at target index and reapplies layout
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "g2"
Received: "g1"

[Survived] MethodExpression
lib/game-store.ts:273:30
               },
             }
           : moved;
-        const clampedIndex = Math.max(0, Math.min(toIndex, ordered.length));
+        const clampedIndex = Math.min(0, Math.min(toIndex, ordered.length));
         ordered.splice(clampedIndex, 0, movedWithSpan);
         const next = applyBoardLayout(ordered, columns);

[Survived] ArrayDeclaration
lib/game-store.ts:279:5
         return next;
       });
     },
-    [setGamesWithPersistence]
+    []
   );
 

[Killed] BlockStatement
lib/game-store.ts:287:25
       gameId: string,
       target: { x: number; y: number; w: number; h: number },
       columns: number = DEFAULT_BOARD_COLUMNS
-    ): Promise<void> => {
-      setGamesWithPersistence((prev) => {
-        if (!prev.some((game) => game.id === gameId)) return prev;
-        const next = applyBoardLayoutWithPinned(prev, gameId, target, columns);
-        return next;
-      });
-    },
+    ): Promise<void> => {},
     [setGamesWithPersistence]
   );
killedBy: useGames moveGameToBoardTarget pins card at requested coordinates
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
    "h": 1,

[Killed] BlockStatement
lib/game-store.ts:288:41
       target: { x: number; y: number; w: number; h: number },
       columns: number = DEFAULT_BOARD_COLUMNS
     ): Promise<void> => {
-      setGamesWithPersistence((prev) => {
-        if (!prev.some((game) => game.id === gameId)) return prev;
-        const next = applyBoardLayoutWithPinned(prev, gameId, target, columns);
-        return next;
-      });
+      setGamesWithPersistence((prev) => {});
     },
     [setGamesWithPersistence]
killedBy: useGames moveGameToBoardTarget pins card at requested coordinates
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[Killed] ConditionalExpression
lib/game-store.ts:289:13
       columns: number = DEFAULT_BOARD_COLUMNS
     ): Promise<void> => {
       setGamesWithPersistence((prev) => {
-        if (!prev.some((game) => game.id === gameId)) return prev;
+        if (false) return prev;
         const next = applyBoardLayoutWithPinned(prev, gameId, target, columns);
         return next;
killedBy: useGames moveGameToBoardTarget is a no-op when game id is missing
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "@gamebook/games", "[{\"id\":\"g1\",\"title\":\"One\",\"status\":\"playing\",\"notes\":[],\"ticketType\":\"ticket\",\"mountStyle\":\"tape\",\"postcardSide\":\"front\",\"board\":{\"x\":0,\"y\":0,\"w\":2,\"h\":1,\"columns\":4}}]"

[Killed] ArrowFunction
lib/game-store.ts:289:24
       columns: number = DEFAULT_BOARD_COLUMNS
     ): Promise<void> => {
       setGamesWithPersistence((prev) => {
-        if (!prev.some((game) => game.id === gameId)) return prev;
+        if (!prev.some(() => undefined)) return prev;
         const next = applyBoardLayoutWithPinned(prev, gameId, target, columns);
         return next;
killedBy: useGames moveGameToBoardTarget pins card at requested coordinates
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
    "h": 1,

[Killed] EqualityOperator
lib/game-store.ts:303:42
       columns: number = DEFAULT_BOARD_COLUMNS
     ): Promise<void> => {
       setGamesWithPersistence((prev) => {
-        const game = prev.find((item) => item.id === gameId);
+        const game = prev.find((item) => item.id !== gameId);
         if (!game) return prev;
 
killedBy: useGames cycleGameSpanPreset cycles through allowed spans for a card type
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Killed] ArrowFunction
lib/game-store.ts:303:32
       columns: number = DEFAULT_BOARD_COLUMNS
     ): Promise<void> => {
       setGamesWithPersistence((prev) => {
-        const game = prev.find((item) => item.id === gameId);
+        const game = prev.find(() => undefined);
         if (!game) return prev;
 
killedBy: useGames cycleGameSpanPreset cycles through allowed spans for a card type
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Killed] BooleanLiteral
lib/game-store.ts:304:13
     ): Promise<void> => {
       setGamesWithPersistence((prev) => {
         const game = prev.find((item) => item.id === gameId);
-        if (!game) return prev;
+        if (game) return prev;
 
         const presets = getCardSpanPresets(game.ticketType, columns);
killedBy: useGames cycleGameSpanPreset cycles through allowed spans for a card type
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Killed] ConditionalExpression
lib/game-store.ts:304:13
     ): Promise<void> => {
       setGamesWithPersistence((prev) => {
         const game = prev.find((item) => item.id === gameId);
-        if (!game) return prev;
+        if (false) return prev;
 
         const presets = getCardSpanPresets(game.ticketType, columns);
killedBy: useGames cycleGameSpanPreset is a no-op when no matching game exists
statusReason: TypeError: Cannot read properties of undefined (reading 'ticketType')

[Killed] ConditionalExpression
lib/game-store.ts:307:13
         if (!game) return prev;
 
         const presets = getCardSpanPresets(game.ticketType, columns);
-        if (presets.length <= 1) return prev;
+        if (false) return prev;
 
         const currentSpan = constrainSpanForCard(
killedBy: useGames cycleGameSpanPreset is a no-op when only one preset is available
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
-   "columns": 4,
+   "columns": 1,

[Killed] EqualityOperator
lib/game-store.ts:307:13
         if (!game) return prev;
 
         const presets = getCardSpanPresets(game.ticketType, columns);
-        if (presets.length <= 1) return prev;
+        if (presets.length < 1) return prev;
 
         const currentSpan = constrainSpanForCard(
killedBy: useGames cycleGameSpanPreset is a no-op when only one preset is available
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
-   "columns": 4,
+   "columns": 1,

[Killed] ObjectLiteral
lib/game-store.ts:312:15
         const currentSpan = constrainSpanForCard(
           game.ticketType,
           game.board
-            ? { w: game.board.w, h: game.board.h }
+            ? {}
             : getCardSpan(game.ticketType),
           columns
killedBy: useGames cycleGameSpanPreset cycles through allowed spans for a card type
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
-   "h": 2,

[Killed] EqualityOperator
lib/game-store.ts:317:23
           columns
         );
         const currentIndex = presets.findIndex(
-          (preset) => preset.w === currentSpan.w && preset.h === currentSpan.h
+          (preset) => preset.w !== currentSpan.w && preset.h === currentSpan.h
         );
         const nextIndex = currentIndex >= 0 ? (currentIndex + 1) % presets.length : 0;
killedBy: useGames cycleGameSpanPreset cycles through allowed spans for a card type
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
-   "h": 1,

[Killed] ConditionalExpression
lib/game-store.ts:317:23
           columns
         );
         const currentIndex = presets.findIndex(
-          (preset) => preset.w === currentSpan.w && preset.h === currentSpan.h
+          (preset) => false
         );
         const nextIndex = currentIndex >= 0 ? (currentIndex + 1) % presets.length : 0;
killedBy: useGames cycleGameSpanPreset cycles through allowed spans for a card type
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Killed] ArithmeticOperator
lib/game-store.ts:319:48
         const currentIndex = presets.findIndex(
           (preset) => preset.w === currentSpan.w && preset.h === currentSpan.h
         );
-        const nextIndex = currentIndex >= 0 ? (currentIndex + 1) % presets.length : 0;
+        const nextIndex = currentIndex >= 0 ? (currentIndex - 1) % presets.length : 0;
         const nextSpan = presets[nextIndex];
         const targetX = game.board?.x ?? 0;
killedBy: useGames cycleGameSpanPreset cycles through allowed spans for a card type
statusReason: TypeError: Cannot read properties of undefined (reading 'w')

[Killed] EqualityOperator
lib/game-store.ts:319:27
         const currentIndex = presets.findIndex(
           (preset) => preset.w === currentSpan.w && preset.h === currentSpan.h
         );
-        const nextIndex = currentIndex >= 0 ? (currentIndex + 1) % presets.length : 0;
+        const nextIndex = currentIndex < 0 ? (currentIndex + 1) % presets.length : 0;
         const nextSpan = presets[nextIndex];
         const targetX = game.board?.x ?? 0;
killedBy: useGames cycleGameSpanPreset cycles through allowed spans for a card type
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Survived] LogicalOperator
lib/game-store.ts:321:25
         );
         const nextIndex = currentIndex >= 0 ? (currentIndex + 1) % presets.length : 0;
         const nextSpan = presets[nextIndex];
-        const targetX = game.board?.x ?? 0;
+        const targetX = game.board?.x && 0;
         const targetY = game.board?.y ?? 0;
 

[Survived] OptionalChaining
lib/game-store.ts:321:25
         );
         const nextIndex = currentIndex >= 0 ? (currentIndex + 1) % presets.length : 0;
         const nextSpan = presets[nextIndex];
-        const targetX = game.board?.x ?? 0;
+        const targetX = game.board.x ?? 0;
         const targetY = game.board?.y ?? 0;
 

[Survived] OptionalChaining
lib/game-store.ts:322:25
         const nextIndex = currentIndex >= 0 ? (currentIndex + 1) % presets.length : 0;
         const nextSpan = presets[nextIndex];
         const targetX = game.board?.x ?? 0;
-        const targetY = game.board?.y ?? 0;
+        const targetY = game.board.y ?? 0;
 
         const next = applyBoardLayoutWithPinned(

[Survived] LogicalOperator
lib/game-store.ts:322:25
         const nextIndex = currentIndex >= 0 ? (currentIndex + 1) % presets.length : 0;
         const nextSpan = presets[nextIndex];
         const targetX = game.board?.x ?? 0;
-        const targetY = game.board?.y ?? 0;
+        const targetY = game.board?.y && 0;
 
         const next = applyBoardLayoutWithPinned(

[Killed] BlockStatement
lib/game-store.ts:342:25
       span: { w: number; h: number },
       columns: number = DEFAULT_BOARD_COLUMNS,
       offset?: { x: number; y: number }
-    ): Promise<void> => {
-      setGamesWithPersistence((prev) => {
-        const game = prev.find((item) => item.id === gameId);
-        if (!game) return prev;
-
-        const targetSpan = constrainSpanForCard(game.ticketType, span, columns);
-        const targetX = (game.board?.x ?? 0) + (offset?.x ?? 0);
-        const targetY = (game.board?.y ?? 0) + (offset?.y ?? 0);
-        const next = applyBoardLayoutWithPinned(
-          prev,
-          gameId,
-          { x: targetX, y: targetY, w: targetSpan.w, h: targetSpan.h },
-          columns
-        );
-        return next;
-      });
-    },
+    ): Promise<void> => {},
     [setGamesWithPersistence]
   );
killedBy: useGames setGameSpanPreset applies explicit preset span
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
-   "h": 2,

[Killed] BlockStatement
lib/game-store.ts:343:41
       columns: number = DEFAULT_BOARD_COLUMNS,
       offset?: { x: number; y: number }
     ): Promise<void> => {
-      setGamesWithPersistence((prev) => {
-        const game = prev.find((item) => item.id === gameId);
-        if (!game) return prev;
-
-        const targetSpan = constrainSpanForCard(game.ticketType, span, columns);
-        const targetX = (game.board?.x ?? 0) + (offset?.x ?? 0);
-        const targetY = (game.board?.y ?? 0) + (offset?.y ?? 0);
-        const next = applyBoardLayoutWithPinned(
-          prev,
-          gameId,
-          { x: targetX, y: targetY, w: targetSpan.w, h: targetSpan.h },
-          columns
-        );
-        return next;
-      });
+      setGamesWithPersistence((prev) => {});
     },
     [setGamesWithPersistence]
killedBy: useGames setGameSpanPreset applies explicit preset span
statusReason: TypeError: Cannot read properties of undefined (reading 'filter')

[Killed] ConditionalExpression
lib/game-store.ts:344:42
       offset?: { x: number; y: number }
     ): Promise<void> => {
       setGamesWithPersistence((prev) => {
-        const game = prev.find((item) => item.id === gameId);
+        const game = prev.find((item) => true);
         if (!game) return prev;
 
killedBy: useGames setGameSpanPreset is a no-op when game id is missing
statusReason: Error: expect(jest.fn()).not.toHaveBeenCalled()

Expected number of calls: 0
Received number of calls: 1

1: "@gamebook/games", "[{\"id\":\"g1\",\"title\":\"Postcard\",\"status\":\"playing\",\"notes\":[],\"ticketType\":\"postcard\",\"mountStyle\":\"tape\",\"postcardSide\":\"front\",\"board\":{\"x\":0,\"y\":0,\"w\":2,\"h\":1,\"columns\":4}}]"

[Killed] ConditionalExpression
lib/game-store.ts:345:13
     ): Promise<void> => {
       setGamesWithPersistence((prev) => {
         const game = prev.find((item) => item.id === gameId);
-        if (!game) return prev;
+        if (true) return prev;
 
         const targetSpan = constrainSpanForCard(game.ticketType, span, columns);
killedBy: useGames setGameSpanPreset applies explicit preset span
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
-   "h": 2,

[Killed] LogicalOperator
lib/game-store.ts:348:49
         if (!game) return prev;
 
         const targetSpan = constrainSpanForCard(game.ticketType, span, columns);
-        const targetX = (game.board?.x ?? 0) + (offset?.x ?? 0);
+        const targetX = (game.board?.x ?? 0) + (offset?.x && 0);
         const targetY = (game.board?.y ?? 0) + (offset?.y ?? 0);
         const next = applyBoardLayoutWithPinned(
killedBy: useGames setGameSpanPreset repositions same-span card with movement offset and reflows neighbors
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Killed] ArithmeticOperator
lib/game-store.ts:348:25
         if (!game) return prev;
 
         const targetSpan = constrainSpanForCard(game.ticketType, span, columns);
-        const targetX = (game.board?.x ?? 0) + (offset?.x ?? 0);
+        const targetX = (game.board?.x ?? 0) - (offset?.x ?? 0);
         const targetY = (game.board?.y ?? 0) + (offset?.y ?? 0);
         const next = applyBoardLayoutWithPinned(
killedBy: useGames setGameSpanPreset repositions same-span card with movement offset and reflows neighbors
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Killed] OptionalChaining
lib/game-store.ts:349:49
 
         const targetSpan = constrainSpanForCard(game.ticketType, span, columns);
         const targetX = (game.board?.x ?? 0) + (offset?.x ?? 0);
-        const targetY = (game.board?.y ?? 0) + (offset?.y ?? 0);
+        const targetY = (game.board?.y ?? 0) + (offset.y ?? 0);
         const next = applyBoardLayoutWithPinned(
           prev,
killedBy: useGames setGameSpanPreset applies explicit preset span
statusReason: TypeError: Cannot read properties of undefined (reading 'y')

[Survived] LogicalOperator
lib/game-store.ts:349:49
 
         const targetSpan = constrainSpanForCard(game.ticketType, span, columns);
         const targetX = (game.board?.x ?? 0) + (offset?.x ?? 0);
-        const targetY = (game.board?.y ?? 0) + (offset?.y ?? 0);
+        const targetY = (game.board?.y ?? 0) + (offset?.y && 0);
         const next = applyBoardLayoutWithPinned(
           prev,

[Killed] ObjectLiteral
lib/game-store.ts:353:11
         const next = applyBoardLayoutWithPinned(
           prev,
           gameId,
-          { x: targetX, y: targetY, w: targetSpan.w, h: targetSpan.h },
+          {},
           columns
         );
killedBy: useGames setGameSpanPreset applies explicit preset span
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
-   "h": 2,
