[Killed] BlockStatement
lib/board-layout.ts:11:57
   GRID_UNITS.map((w) => `${w}x${h}` as GridSizeId)
 );
 
-function gridSizeIdToSpan(sizeId: GridSizeId): GridSpan {
-  const [w, h] = sizeId.split("x").map(Number);
-  return { w, h };
-}
+function gridSizeIdToSpan(sizeId: GridSizeId): GridSpan {}
 
 const DEFAULT_GRID_SIZE_ID_BY_TICKET_TYPE: Record<TicketType, GridSizeId> = {
killedBy: useGames seeds default games when storage is empty
statusReason: TypeError: Cannot read properties of undefined (reading 'w')

[Killed] StringLiteral
lib/board-layout.ts:12:31
 );
 
 function gridSizeIdToSpan(sizeId: GridSizeId): GridSpan {
-  const [w, h] = sizeId.split("x").map(Number);
+  const [w, h] = sizeId.split("").map(Number);
   return { w, h };
 }
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).not.toMatchObject(expected)

Expected: not {"x": 0, "y": 0}
Received:     {"columns": 4, "h": NaN, "w": 2, "x": 0, "y": 0}

[Killed] BlockStatement
lib/board-layout.ts:34:17
 
 export function getAllowedGridSizeIds(
   ticketType: TicketType | undefined
-): GridSizeId[] {
-  if (!ticketType) return ["1x1"];
-  return ALLOWED_GRID_SIZE_IDS_BY_TICKET_TYPE[ticketType];
-}
+): GridSizeId[] {}
 
 export function getCardSpan(ticketType: TicketType | undefined): {
killedBy: useGames seeds default games when storage is empty
statusReason: TypeError: Cannot read properties of undefined (reading 'map')

[Killed] ConditionalExpression
lib/board-layout.ts:35:7
 export function getAllowedGridSizeIds(
   ticketType: TicketType | undefined
 ): GridSizeId[] {
-  if (!ticketType) return ["1x1"];
+  if (true) return ["1x1"];
   return ALLOWED_GRID_SIZE_IDS_BY_TICKET_TYPE[ticketType];
 }
killedBy: useGames reorderGame applies span override so moved card can occupy more slots
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
-   "h": 2,

[Killed] ConditionalExpression
lib/board-layout.ts:35:7
 export function getAllowedGridSizeIds(
   ticketType: TicketType | undefined
 ): GridSizeId[] {
-  if (!ticketType) return ["1x1"];
+  if (false) return ["1x1"];
   return ALLOWED_GRID_SIZE_IDS_BY_TICKET_TYPE[ticketType];
 }
killedBy: board-layout uses 1x1 defaults when ticket type is missing
statusReason: Error: expect(received).toEqual(expected) // deep equality

Expected: ["1x1"]
Received: undefined

[Killed] BlockStatement
lib/board-layout.ts:42:3
 export function getCardSpan(ticketType: TicketType | undefined): {
   w: number;
   h: number;
-} {
-  if (!ticketType) return { w: 1, h: 1 };
-  const sizeId = DEFAULT_GRID_SIZE_ID_BY_TICKET_TYPE[ticketType];
-  return gridSizeIdToSpan(sizeId);
-}
+} {}
 
 export function getCardSpanPresets(
killedBy: useGames seeds default games when storage is empty
statusReason: TypeError: Cannot read properties of undefined (reading 'w')

[Killed] ConditionalExpression
lib/board-layout.ts:43:7
   w: number;
   h: number;
 } {
-  if (!ticketType) return { w: 1, h: 1 };
+  if (false) return { w: 1, h: 1 };
   const sizeId = DEFAULT_GRID_SIZE_ID_BY_TICKET_TYPE[ticketType];
   return gridSizeIdToSpan(sizeId);
killedBy: board-layout uses 1x1 defaults when ticket type is missing
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] BooleanLiteral
lib/board-layout.ts:43:7
   w: number;
   h: number;
 } {
-  if (!ticketType) return { w: 1, h: 1 };
+  if (ticketType) return { w: 1, h: 1 };
   const sizeId = DEFAULT_GRID_SIZE_ID_BY_TICKET_TYPE[ticketType];
   return gridSizeIdToSpan(sizeId);
killedBy: board-layout uses 1x1 defaults when ticket type is missing
statusReason: TypeError: Cannot read properties of undefined (reading 'split')

[Killed] BlockStatement
lib/board-layout.ts:51:15
 export function getCardSpanPresets(
   ticketType: TicketType | undefined,
   columns: number
-): GridSpan[] {
-  const maxW = Math.max(1, Math.min(columns, 4));
-  const visible = getAllowedGridSizeIds(ticketType)
-    .map((sizeId) => gridSizeIdToSpan(sizeId))
-    .filter((preset) => preset.w <= maxW);
-  return visible.length > 0 ? visible : [{ w: 1, h: 1 }];
-}
+): GridSpan[] {}
 
 export function constrainSpanForCard(
killedBy: board-layout findBestInsertion can move polaroid card to top-left
statusReason: TypeError: Cannot read properties of undefined (reading 'find')

[Killed] MethodExpression
lib/board-layout.ts:52:28
   ticketType: TicketType | undefined,
   columns: number
 ): GridSpan[] {
-  const maxW = Math.max(1, Math.min(columns, 4));
+  const maxW = Math.max(1, Math.max(columns, 4));
   const visible = getAllowedGridSizeIds(ticketType)
     .map((sizeId) => gridSizeIdToSpan(sizeId))
killedBy: useGames cycleGameSpanPreset is a no-op when only one preset is available
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
-   "columns": 4,
+   "columns": 1,

[Killed] MethodExpression
lib/board-layout.ts:52:16
   ticketType: TicketType | undefined,
   columns: number
 ): GridSpan[] {
-  const maxW = Math.max(1, Math.min(columns, 4));
+  const maxW = Math.min(1, Math.min(columns, 4));
   const visible = getAllowedGridSizeIds(ticketType)
     .map((sizeId) => gridSizeIdToSpan(sizeId))
killedBy: useGames reorderGame applies span override so moved card can occupy more slots
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 2,

[Killed] MethodExpression
lib/board-layout.ts:53:19
   columns: number
 ): GridSpan[] {
   const maxW = Math.max(1, Math.min(columns, 4));
-  const visible = getAllowedGridSizeIds(ticketType)
-    .map((sizeId) => gridSizeIdToSpan(sizeId))
-    .filter((preset) => preset.w <= maxW);
+  const visible = getAllowedGridSizeIds(ticketType).map(sizeId => gridSizeIdToSpan(sizeId));
   return visible.length > 0 ? visible : [{ w: 1, h: 1 }];
 }
killedBy: useGames cycleGameSpanPreset is a no-op when only one preset is available
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
-   "columns": 4,
+   "columns": 1,

[Killed] ArrowFunction
lib/board-layout.ts:54:10
 ): GridSpan[] {
   const maxW = Math.max(1, Math.min(columns, 4));
   const visible = getAllowedGridSizeIds(ticketType)
-    .map((sizeId) => gridSizeIdToSpan(sizeId))
+    .map(() => undefined)
     .filter((preset) => preset.w <= maxW);
   return visible.length > 0 ? visible : [{ w: 1, h: 1 }];
killedBy: useGames seeds default games when storage is empty
statusReason: TypeError: Cannot read properties of undefined (reading 'w')

[Killed] ArrowFunction
lib/board-layout.ts:55:13
   const maxW = Math.max(1, Math.min(columns, 4));
   const visible = getAllowedGridSizeIds(ticketType)
     .map((sizeId) => gridSizeIdToSpan(sizeId))
-    .filter((preset) => preset.w <= maxW);
+    .filter(() => undefined);
   return visible.length > 0 ? visible : [{ w: 1, h: 1 }];
 }
killedBy: useGames reorderGame applies span override so moved card can occupy more slots
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
-   "h": 2,

[Killed] ConditionalExpression
lib/board-layout.ts:55:25
   const maxW = Math.max(1, Math.min(columns, 4));
   const visible = getAllowedGridSizeIds(ticketType)
     .map((sizeId) => gridSizeIdToSpan(sizeId))
-    .filter((preset) => preset.w <= maxW);
+    .filter((preset) => true);
   return visible.length > 0 ? visible : [{ w: 1, h: 1 }];
 }
killedBy: useGames cycleGameSpanPreset is a no-op when only one preset is available
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
-   "columns": 4,
+   "columns": 1,

[Killed] EqualityOperator
lib/board-layout.ts:56:10
   const visible = getAllowedGridSizeIds(ticketType)
     .map((sizeId) => gridSizeIdToSpan(sizeId))
     .filter((preset) => preset.w <= maxW);
-  return visible.length > 0 ? visible : [{ w: 1, h: 1 }];
+  return visible.length <= 0 ? visible : [{ w: 1, h: 1 }];
 }
 
killedBy: useGames reorderGame applies span override so moved card can occupy more slots
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
-   "h": 2,

[Killed] EqualityOperator
lib/board-layout.ts:56:10
   const visible = getAllowedGridSizeIds(ticketType)
     .map((sizeId) => gridSizeIdToSpan(sizeId))
     .filter((preset) => preset.w <= maxW);
-  return visible.length > 0 ? visible : [{ w: 1, h: 1 }];
+  return visible.length >= 0 ? visible : [{ w: 1, h: 1 }];
 }
 
killedBy: board-layout falls back to 1x1 presets when columns hide all allowed widths
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

- Array [
-   Object {
-     "h": 1,

[Killed] BlockStatement
lib/board-layout.ts:63:29
   ticketType: TicketType | undefined,
   desired: { w: number; h: number },
   columns: number
-): { w: number; h: number } {
-  const presets = getCardSpanPresets(ticketType, columns);
-  const exact = presets.find((preset) => preset.w === desired.w && preset.h === desired.h);
-  if (exact) return exact;
-
-  const desiredArea = desired.w * desired.h;
-  const largestPreset = presets.reduce((largest, preset) => {
-    const area = preset.w * preset.h;
-    const largestArea = largest.w * largest.h;
-    return area > largestArea ? preset : largest;
-  }, presets[0]);
-
-  if (desiredArea > largestPreset.w * largestPreset.h) {
-    return largestPreset;
-  }
-
-  return presets[0];
-}
+): { w: number; h: number } {}
 
 function clampSpan(span: { w: number; h: number }, columns: number): {
killedBy: board-layout findBestInsertion can move polaroid card to top-left
statusReason: TypeError: Cannot read properties of undefined (reading 'w')

[Killed] ConditionalExpression
lib/board-layout.ts:65:42
   columns: number
 ): { w: number; h: number } {
   const presets = getCardSpanPresets(ticketType, columns);
-  const exact = presets.find((preset) => preset.w === desired.w && preset.h === desired.h);
+  const exact = presets.find((preset) => false);
   if (exact) return exact;
 
killedBy: useGames reorderGame applies span override so moved card can occupy more slots
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
-   "h": 2,

[Killed] EqualityOperator
lib/board-layout.ts:65:68
   columns: number
 ): { w: number; h: number } {
   const presets = getCardSpanPresets(ticketType, columns);
-  const exact = presets.find((preset) => preset.w === desired.w && preset.h === desired.h);
+  const exact = presets.find((preset) => preset.w === desired.w && preset.h !== desired.h);
   if (exact) return exact;
 
killedBy: useGames reorderGame applies span override so moved card can occupy more slots
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
-   "h": 2,

[Killed] ConditionalExpression
lib/board-layout.ts:66:7
 ): { w: number; h: number } {
   const presets = getCardSpanPresets(ticketType, columns);
   const exact = presets.find((preset) => preset.w === desired.w && preset.h === desired.h);
-  if (exact) return exact;
+  if (false) return exact;
 
   const desiredArea = desired.w * desired.h;
killedBy: useGames reorderGame applies span override so moved card can occupy more slots
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
-   "h": 2,

[Killed] ConditionalExpression
lib/board-layout.ts:66:7
 ): { w: number; h: number } {
   const presets = getCardSpanPresets(ticketType, columns);
   const exact = presets.find((preset) => preset.w === desired.w && preset.h === desired.h);
-  if (exact) return exact;
+  if (true) return exact;
 
   const desiredArea = desired.w * desired.h;
killedBy: useGames moveGameToBoardTarget constrains pinned span to the card's allowed presets
statusReason: TypeError: Cannot read properties of undefined (reading 'w')

[Killed] ArithmeticOperator
lib/board-layout.ts:68:23
   const exact = presets.find((preset) => preset.w === desired.w && preset.h === desired.h);
   if (exact) return exact;
 
-  const desiredArea = desired.w * desired.h;
+  const desiredArea = desired.w / desired.h;
   const largestPreset = presets.reduce((largest, preset) => {
     const area = preset.w * preset.h;
killedBy: useGames normalizes legacy invalid spans on load
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
-   "h": 2,

[Killed] BlockStatement
lib/board-layout.ts:69:61
   if (exact) return exact;
 
   const desiredArea = desired.w * desired.h;
-  const largestPreset = presets.reduce((largest, preset) => {
-    const area = preset.w * preset.h;
-    const largestArea = largest.w * largest.h;
-    return area > largestArea ? preset : largest;
-  }, presets[0]);
+  const largestPreset = presets.reduce((largest, preset) => {}, presets[0]);
 
   if (desiredArea > largestPreset.w * largestPreset.h) {
killedBy: useGames moveGameToBoardTarget constrains pinned span to the card's allowed presets
statusReason: TypeError: Cannot read properties of undefined (reading 'w')

[Killed] ArithmeticOperator
lib/board-layout.ts:70:18
 
   const desiredArea = desired.w * desired.h;
   const largestPreset = presets.reduce((largest, preset) => {
-    const area = preset.w * preset.h;
+    const area = preset.w / preset.h;
     const largestArea = largest.w * largest.h;
     return area > largestArea ? preset : largest;
killedBy: useGames normalizes legacy invalid spans on load
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
-   "h": 2,

[Survived] ArithmeticOperator
lib/board-layout.ts:71:25
   const desiredArea = desired.w * desired.h;
   const largestPreset = presets.reduce((largest, preset) => {
     const area = preset.w * preset.h;
-    const largestArea = largest.w * largest.h;
+    const largestArea = largest.w / largest.h;
     return area > largestArea ? preset : largest;
   }, presets[0]);

[Killed] EqualityOperator
lib/board-layout.ts:72:12
   const largestPreset = presets.reduce((largest, preset) => {
     const area = preset.w * preset.h;
     const largestArea = largest.w * largest.h;
-    return area > largestArea ? preset : largest;
+    return area <= largestArea ? preset : largest;
   }, presets[0]);
 
killedBy: useGames normalizes legacy invalid spans on load
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
-   "h": 2,

[Killed] ConditionalExpression
lib/board-layout.ts:72:12
   const largestPreset = presets.reduce((largest, preset) => {
     const area = preset.w * preset.h;
     const largestArea = largest.w * largest.h;
-    return area > largestArea ? preset : largest;
+    return false ? preset : largest;
   }, presets[0]);
 
killedBy: useGames normalizes legacy invalid spans on load
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
-   "h": 2,

[Killed] ArithmeticOperator
lib/board-layout.ts:75:21
     return area > largestArea ? preset : largest;
   }, presets[0]);
 
-  if (desiredArea > largestPreset.w * largestPreset.h) {
+  if (desiredArea > largestPreset.w / largestPreset.h) {
     return largestPreset;
   }
killedBy: board-layout constrains legacy spans to type presets
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
-   "h": 1,
-   "w": 1,

[Killed] EqualityOperator
lib/board-layout.ts:75:7
     return area > largestArea ? preset : largest;
   }, presets[0]);
 
-  if (desiredArea > largestPreset.w * largestPreset.h) {
+  if (desiredArea <= largestPreset.w * largestPreset.h) {
     return largestPreset;
   }
killedBy: board-layout constrains legacy spans to type presets
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
-   "h": 1,
-   "w": 1,

[Killed] BlockStatement
lib/board-layout.ts:85:3
 function clampSpan(span: { w: number; h: number }, columns: number): {
   w: number;
   h: number;
-} {
-  return {
-    w: Math.max(1, Math.min(span.w, Math.min(columns, 4))),
-    h: Math.max(1, Math.min(span.h, 4)),
-  };
-}
+} {}
 
 export function getEffectiveCardSpan(game: Game, columns: number): {
killedBy: board-layout findBestInsertion can move polaroid card to top-left
statusReason: TypeError: Cannot read properties of undefined (reading 'w')

[Killed] MethodExpression
lib/board-layout.ts:87:20
   h: number;
 } {
   return {
-    w: Math.max(1, Math.min(span.w, Math.min(columns, 4))),
+    w: Math.max(1, Math.max(span.w, Math.min(columns, 4))),
     h: Math.max(1, Math.min(span.h, 4)),
   };
killedBy: useGames cycleGameSpanPreset cycles through allowed spans for a card type
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Killed] MethodExpression
lib/board-layout.ts:87:8
   h: number;
 } {
   return {
-    w: Math.max(1, Math.min(span.w, Math.min(columns, 4))),
+    w: Math.min(1, Math.min(span.w, Math.min(columns, 4))),
     h: Math.max(1, Math.min(span.h, 4)),
   };
killedBy: board-layout applies span overrides for push/reflow placement
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "h": 2,
-   "w": 2,

[Killed] MethodExpression
lib/board-layout.ts:88:20
 } {
   return {
     w: Math.max(1, Math.min(span.w, Math.min(columns, 4))),
-    h: Math.max(1, Math.min(span.h, 4)),
+    h: Math.max(1, Math.max(span.h, 4)),
   };
 }
killedBy: useGames moveGameToBoardTarget pins card at requested coordinates
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
-   "h": 1,

[Killed] MethodExpression
lib/board-layout.ts:88:8
 } {
   return {
     w: Math.max(1, Math.min(span.w, Math.min(columns, 4))),
-    h: Math.max(1, Math.min(span.h, 4)),
+    h: Math.min(1, Math.min(span.h, 4)),
   };
 }
killedBy: useGames reorderGame applies span override so moved card can occupy more slots
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
-   "h": 2,

[Killed] BlockStatement
lib/board-layout.ts:95:3
 export function getEffectiveCardSpan(game: Game, columns: number): {
   w: number;
   h: number;
-} {
-  const explicit = game.board ? { w: game.board.w, h: game.board.h } : undefined;
-  return constrainSpanForCard(
-    game.ticketType,
-    clampSpan(explicit ?? getCardSpan(game.ticketType), columns),
-    columns
-  );
-}
+} {}
 
 export function applyBoardLayout(games: Game[], columns: number): Game[] {
killedBy: useGames seeds default games when storage is empty
statusReason: TypeError: Cannot read properties of undefined (reading 'w')

[Killed] ObjectLiteral
lib/board-layout.ts:96:33
   w: number;
   h: number;
 } {
-  const explicit = game.board ? { w: game.board.w, h: game.board.h } : undefined;
+  const explicit = game.board ? {} : undefined;
   return constrainSpanForCard(
     game.ticketType,
killedBy: useGames reorderGame applies span override so moved card can occupy more slots
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
-   "h": 2,

[Killed] LogicalOperator
lib/board-layout.ts:99:15
   const explicit = game.board ? { w: game.board.w, h: game.board.h } : undefined;
   return constrainSpanForCard(
     game.ticketType,
-    clampSpan(explicit ?? getCardSpan(game.ticketType), columns),
+    clampSpan(explicit && getCardSpan(game.ticketType), columns),
     columns
   );
killedBy: useGames seeds default games when storage is empty
statusReason: TypeError: Cannot read properties of undefined (reading 'w')

[Timeout] BlockStatement
lib/board-layout.ts:107:66
 export function applyBoardLayout(games: Game[], columns: number): Game[] {
   const occupied = new Set<string>();
 
-  const isFree = (x: number, y: number, w: number, h: number) => {
-    for (let row = y; row < y + h; row += 1) {
-      for (let col = x; col < x + w; col += 1) {
-        if (occupied.has(`${col},${row}`)) return false;
-      }
-    }
-    return true;
-  };
+  const isFree = (x: number, y: number, w: number, h: number) => {};
 
   const markUsed = (x: number, y: number, w: number, h: number) => {

[Killed] BlockStatement
lib/board-layout.ts:108:46
   const occupied = new Set<string>();
 
   const isFree = (x: number, y: number, w: number, h: number) => {
-    for (let row = y; row < y + h; row += 1) {
-      for (let col = x; col < x + w; col += 1) {
-        if (occupied.has(`${col},${row}`)) return false;
-      }
-    }
+    for (let row = y; row < y + h; row += 1) {}
     return true;
   };
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).not.toMatchObject(expected)

Expected: not {"x": 0, "y": 0}
Received:     {"columns": 4, "h": 1, "w": 2, "x": 0, "y": 0}

[Killed] ArithmeticOperator
lib/board-layout.ts:108:29
   const occupied = new Set<string>();
 
   const isFree = (x: number, y: number, w: number, h: number) => {
-    for (let row = y; row < y + h; row += 1) {
+    for (let row = y; row < y - h; row += 1) {
       for (let col = x; col < x + w; col += 1) {
         if (occupied.has(`${col},${row}`)) return false;
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).not.toMatchObject(expected)

Expected: not {"x": 0, "y": 0}
Received:     {"columns": 4, "h": 1, "w": 2, "x": 0, "y": 0}

[Killed] ConditionalExpression
lib/board-layout.ts:109:25
 
   const isFree = (x: number, y: number, w: number, h: number) => {
     for (let row = y; row < y + h; row += 1) {
-      for (let col = x; col < x + w; col += 1) {
+      for (let col = x; false; col += 1) {
         if (occupied.has(`${col},${row}`)) return false;
       }
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).not.toMatchObject(expected)

Expected: not {"x": 0, "y": 0}
Received:     {"columns": 4, "h": 1, "w": 2, "x": 0, "y": 0}

[Killed] BlockStatement
lib/board-layout.ts:109:48
 
   const isFree = (x: number, y: number, w: number, h: number) => {
     for (let row = y; row < y + h; row += 1) {
-      for (let col = x; col < x + w; col += 1) {
-        if (occupied.has(`${col},${row}`)) return false;
-      }
+      for (let col = x; col < x + w; col += 1) {}
     }
     return true;
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).not.toMatchObject(expected)

Expected: not {"x": 0, "y": 0}
Received:     {"columns": 4, "h": 1, "w": 2, "x": 0, "y": 0}

[Killed] BooleanLiteral
lib/board-layout.ts:110:51
   const isFree = (x: number, y: number, w: number, h: number) => {
     for (let row = y; row < y + h; row += 1) {
       for (let col = x; col < x + w; col += 1) {
-        if (occupied.has(`${col},${row}`)) return false;
+        if (occupied.has(`${col},${row}`)) return true;
       }
     }
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).not.toMatchObject(expected)

Expected: not {"x": 0, "y": 0}
Received:     {"columns": 4, "h": 1, "w": 2, "x": 0, "y": 0}

[Killed] ConditionalExpression
lib/board-layout.ts:110:13
   const isFree = (x: number, y: number, w: number, h: number) => {
     for (let row = y; row < y + h; row += 1) {
       for (let col = x; col < x + w; col += 1) {
-        if (occupied.has(`${col},${row}`)) return false;
+        if (false) return false;
       }
     }
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).not.toMatchObject(expected)

Expected: not {"x": 0, "y": 0}
Received:     {"columns": 4, "h": 1, "w": 2, "x": 0, "y": 0}

[Killed] BlockStatement
lib/board-layout.ts:116:68
     return true;
   };
 
-  const markUsed = (x: number, y: number, w: number, h: number) => {
-    for (let row = y; row < y + h; row += 1) {
-      for (let col = x; col < x + w; col += 1) {
-        occupied.add(`${col},${row}`);
-      }
-    }
-  };
+  const markUsed = (x: number, y: number, w: number, h: number) => {};
 
   return games.map((game) => {
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).not.toMatchObject(expected)

Expected: not {"x": 0, "y": 0}
Received:     {"columns": 4, "h": 1, "w": 2, "x": 0, "y": 0}

[Killed] EqualityOperator
lib/board-layout.ts:117:23
   };
 
   const markUsed = (x: number, y: number, w: number, h: number) => {
-    for (let row = y; row < y + h; row += 1) {
+    for (let row = y; row >= y + h; row += 1) {
       for (let col = x; col < x + w; col += 1) {
         occupied.add(`${col},${row}`);
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).not.toMatchObject(expected)

Expected: not {"x": 0, "y": 0}
Received:     {"columns": 4, "h": 1, "w": 2, "x": 0, "y": 0}

[Killed] ConditionalExpression
lib/board-layout.ts:117:23
   };
 
   const markUsed = (x: number, y: number, w: number, h: number) => {
-    for (let row = y; row < y + h; row += 1) {
+    for (let row = y; false; row += 1) {
       for (let col = x; col < x + w; col += 1) {
         occupied.add(`${col},${row}`);
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).not.toMatchObject(expected)

Expected: not {"x": 0, "y": 0}
Received:     {"columns": 4, "h": 1, "w": 2, "x": 0, "y": 0}

[Killed] EqualityOperator
lib/board-layout.ts:118:25
 
   const markUsed = (x: number, y: number, w: number, h: number) => {
     for (let row = y; row < y + h; row += 1) {
-      for (let col = x; col < x + w; col += 1) {
+      for (let col = x; col <= x + w; col += 1) {
         occupied.add(`${col},${row}`);
       }
killedBy: board-layout chooses a deterministic insertion index for symmetric placements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArithmeticOperator
lib/board-layout.ts:118:31
 
   const markUsed = (x: number, y: number, w: number, h: number) => {
     for (let row = y; row < y + h; row += 1) {
-      for (let col = x; col < x + w; col += 1) {
+      for (let col = x; col < x - w; col += 1) {
         occupied.add(`${col},${row}`);
       }
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).not.toMatchObject(expected)

Expected: not {"x": 0, "y": 0}
Received:     {"columns": 4, "h": 1, "w": 2, "x": 0, "y": 0}

[Killed] MethodExpression
lib/board-layout.ts:126:15
 
   return games.map((game) => {
     const span = getEffectiveCardSpan(game, columns);
-    const w = Math.min(span.w, columns);
+    const w = Math.max(span.w, columns);
 
     let y = 0;
killedBy: useGames reorderGame applies span override so moved card can occupy more slots
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 2,

[Killed] BooleanLiteral
lib/board-layout.ts:130:18
 
     let y = 0;
     let x = 0;
-    let placed = false;
+    let placed = true;
 
     while (!placed) {
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).not.toMatchObject(expected)

Expected: not {"x": 0, "y": 0}
Received:     {"columns": 4, "h": 1, "w": 2, "x": 0, "y": 0}

[Killed] ConditionalExpression
lib/board-layout.ts:132:12
     let x = 0;
     let placed = false;
 
-    while (!placed) {
+    while (false) {
       for (let candidateX = 0; candidateX <= columns - w; candidateX += 1) {
         if (isFree(candidateX, y, w, span.h)) {
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).not.toMatchObject(expected)

Expected: not {"x": 0, "y": 0}
Received:     {"columns": 4, "h": 1, "w": 2, "x": 0, "y": 0}

[Killed] BooleanLiteral
lib/board-layout.ts:132:12
     let x = 0;
     let placed = false;
 
-    while (!placed) {
+    while (placed) {
       for (let candidateX = 0; candidateX <= columns - w; candidateX += 1) {
         if (isFree(candidateX, y, w, span.h)) {
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).not.toMatchObject(expected)

Expected: not {"x": 0, "y": 0}
Received:     {"columns": 4, "h": 1, "w": 2, "x": 0, "y": 0}

[Killed] AssignmentOperator
lib/board-layout.ts:133:59
     let placed = false;
 
     while (!placed) {
-      for (let candidateX = 0; candidateX <= columns - w; candidateX += 1) {
+      for (let candidateX = 0; candidateX <= columns - w; candidateX -= 1) {
         if (isFree(candidateX, y, w, span.h)) {
           x = candidateX;
killedBy: board-layout chooses a deterministic insertion index for symmetric placements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] ArithmeticOperator
lib/board-layout.ts:133:46
     let placed = false;
 
     while (!placed) {
-      for (let candidateX = 0; candidateX <= columns - w; candidateX += 1) {
+      for (let candidateX = 0; candidateX <= columns + w; candidateX += 1) {
         if (isFree(candidateX, y, w, span.h)) {
           x = candidateX;
