[Killed] ConditionalExpression
lib/board-layout.ts:134:13
 
     while (!placed) {
       for (let candidateX = 0; candidateX <= columns - w; candidateX += 1) {
-        if (isFree(candidateX, y, w, span.h)) {
+        if (true) {
           x = candidateX;
           placed = true;
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).not.toMatchObject(expected)

Expected: not {"x": 0, "y": 0}
Received:     {"columns": 4, "h": 1, "w": 2, "x": 0, "y": 0}

[Timeout] ConditionalExpression
lib/board-layout.ts:134:13
 
     while (!placed) {
       for (let candidateX = 0; candidateX <= columns - w; candidateX += 1) {
-        if (isFree(candidateX, y, w, span.h)) {
+        if (false) {
           x = candidateX;
           placed = true;

[Timeout] BooleanLiteral
lib/board-layout.ts:136:20
       for (let candidateX = 0; candidateX <= columns - w; candidateX += 1) {
         if (isFree(candidateX, y, w, span.h)) {
           x = candidateX;
-          placed = true;
+          placed = false;
           break;
         }

[Killed] BooleanLiteral
lib/board-layout.ts:140:11
           break;
         }
       }
-      if (!placed) y += 1;
+      if (placed) y += 1;
     }
 
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "x": 0,
-   "y": 0,

[Killed] ConditionalExpression
lib/board-layout.ts:140:11
           break;
         }
       }
-      if (!placed) y += 1;
+      if (true) y += 1;
     }
 
killedBy: useGames places newest game at top-left and reflows existing board layout
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "x": 0,
-   "y": 0,

[Killed] ArrowFunction
lib/board-layout.ts:158:33
   pinnedTarget: { x: number; y: number; w: number; h: number },
   columns: number
 ): Game[] {
-  const pinnedGame = games.find((game) => game.id === pinnedGameId);
+  const pinnedGame = games.find(() => undefined);
   if (!pinnedGame) return applyBoardLayout(games, columns);
 
killedBy: useGames moveGameToBoardTarget pins card at requested coordinates
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
    "h": 1,

[Killed] ConditionalExpression
lib/board-layout.ts:158:43
   pinnedTarget: { x: number; y: number; w: number; h: number },
   columns: number
 ): Game[] {
-  const pinnedGame = games.find((game) => game.id === pinnedGameId);
+  const pinnedGame = games.find((game) => false);
   if (!pinnedGame) return applyBoardLayout(games, columns);
 
killedBy: useGames moveGameToBoardTarget pins card at requested coordinates
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
    "h": 1,

[Killed] BooleanLiteral
lib/board-layout.ts:159:7
   columns: number
 ): Game[] {
   const pinnedGame = games.find((game) => game.id === pinnedGameId);
-  if (!pinnedGame) return applyBoardLayout(games, columns);
+  if (pinnedGame) return applyBoardLayout(games, columns);
 
   const occupied = new Set<string>();
killedBy: useGames moveGameToBoardTarget pins card at requested coordinates
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
    "h": 1,

[Killed] ConditionalExpression
lib/board-layout.ts:159:7
   columns: number
 ): Game[] {
   const pinnedGame = games.find((game) => game.id === pinnedGameId);
-  if (!pinnedGame) return applyBoardLayout(games, columns);
+  if (true) return applyBoardLayout(games, columns);
 
   const occupied = new Set<string>();
killedBy: useGames moveGameToBoardTarget pins card at requested coordinates
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
    "h": 1,

[Killed] EqualityOperator
lib/board-layout.ts:165:23
   const placements = new Map<string, Game["board"]>();
 
   const isFree = (x: number, y: number, w: number, h: number) => {
-    for (let row = y; row < y + h; row += 1) {
+    for (let row = y; row >= y + h; row += 1) {
       for (let col = x; col < x + w; col += 1) {
         if (occupied.has(`${col},${row}`)) return false;
killedBy: useGames moveGameToBoardTarget reflows neighbors deterministically around the pinned target
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Killed] ConditionalExpression
lib/board-layout.ts:165:23
   const placements = new Map<string, Game["board"]>();
 
   const isFree = (x: number, y: number, w: number, h: number) => {
-    for (let row = y; row < y + h; row += 1) {
+    for (let row = y; false; row += 1) {
       for (let col = x; col < x + w; col += 1) {
         if (occupied.has(`${col},${row}`)) return false;
killedBy: useGames moveGameToBoardTarget reflows neighbors deterministically around the pinned target
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Killed] EqualityOperator
lib/board-layout.ts:166:25
 
   const isFree = (x: number, y: number, w: number, h: number) => {
     for (let row = y; row < y + h; row += 1) {
-      for (let col = x; col < x + w; col += 1) {
+      for (let col = x; col >= x + w; col += 1) {
         if (occupied.has(`${col},${row}`)) return false;
       }
killedBy: useGames moveGameToBoardTarget reflows neighbors deterministically around the pinned target
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Killed] ObjectLiteral
lib/board-layout.ts:183:15
 
   const pinnedSpan = constrainSpanForCard(
     pinnedGame.ticketType,
-    clampSpan({ w: pinnedTarget.w, h: pinnedTarget.h }, columns),
+    clampSpan({}, columns),
     columns
   );
killedBy: useGames cycleGameSpanPreset cycles through allowed spans for a card type
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Killed] MethodExpression
lib/board-layout.ts:186:31
     clampSpan({ w: pinnedTarget.w, h: pinnedTarget.h }, columns),
     columns
   );
-  const pinnedX = Math.max(0, Math.min(columns - pinnedSpan.w, pinnedTarget.x));
+  const pinnedX = Math.max(0, Math.max(columns - pinnedSpan.w, pinnedTarget.x));
   const pinnedY = Math.max(0, pinnedTarget.y);
   markUsed(pinnedX, pinnedY, pinnedSpan.w, pinnedSpan.h);
killedBy: useGames moveGameToBoardTarget reflows neighbors deterministically around the pinned target
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Killed] MethodExpression
lib/board-layout.ts:186:19
     clampSpan({ w: pinnedTarget.w, h: pinnedTarget.h }, columns),
     columns
   );
-  const pinnedX = Math.max(0, Math.min(columns - pinnedSpan.w, pinnedTarget.x));
+  const pinnedX = Math.min(0, Math.min(columns - pinnedSpan.w, pinnedTarget.x));
   const pinnedY = Math.max(0, pinnedTarget.y);
   markUsed(pinnedX, pinnedY, pinnedSpan.w, pinnedSpan.h);
killedBy: useGames moveGameToBoardTarget pins card at requested coordinates
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Killed] MethodExpression
lib/board-layout.ts:187:19
     columns
   );
   const pinnedX = Math.max(0, Math.min(columns - pinnedSpan.w, pinnedTarget.x));
-  const pinnedY = Math.max(0, pinnedTarget.y);
+  const pinnedY = Math.min(0, pinnedTarget.y);
   markUsed(pinnedX, pinnedY, pinnedSpan.w, pinnedSpan.h);
   placements.set(pinnedGameId, {
killedBy: useGames moveGameToBoardTarget pins card at requested coordinates
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Killed] ObjectLiteral
lib/board-layout.ts:189:32
   const pinnedX = Math.max(0, Math.min(columns - pinnedSpan.w, pinnedTarget.x));
   const pinnedY = Math.max(0, pinnedTarget.y);
   markUsed(pinnedX, pinnedY, pinnedSpan.w, pinnedSpan.h);
-  placements.set(pinnedGameId, {
-    x: pinnedX,
-    y: pinnedY,
-    w: pinnedSpan.w,
-    h: pinnedSpan.h,
-    columns,
-  });
+  placements.set(pinnedGameId, {});
 
   for (const game of games) {
killedBy: useGames moveGameToBoardTarget pins card at requested coordinates
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 7
+ Received  + 1

- Object {
-   "columns": 4,
-   "h": 1,

[Killed] BlockStatement
lib/board-layout.ts:197:29
     columns,
   });
 
-  for (const game of games) {
-    if (game.id === pinnedGameId) continue;
-    const span = getEffectiveCardSpan(game, columns);
-    const w = Math.min(span.w, columns);
-
-    let y = 0;
-    let x = 0;
-    let placed = false;
-
-    while (!placed) {
-      for (let candidateX = 0; candidateX <= columns - w; candidateX += 1) {
-        if (isFree(candidateX, y, w, span.h)) {
-          x = candidateX;
-          placed = true;
-          break;
-        }
-      }
-      if (!placed) y += 1;
-    }
-
-    markUsed(x, y, w, span.h);
-    placements.set(game.id, { x, y, w, h: span.h, columns });
-  }
+  for (const game of games) {}
 
   return games.map((game) => ({
killedBy: useGames moveGameToBoardTarget reflows neighbors deterministically around the pinned target
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Killed] ConditionalExpression
lib/board-layout.ts:198:9
   });
 
   for (const game of games) {
-    if (game.id === pinnedGameId) continue;
+    if (true) continue;
     const span = getEffectiveCardSpan(game, columns);
     const w = Math.min(span.w, columns);
killedBy: useGames moveGameToBoardTarget reflows neighbors deterministically around the pinned target
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 1
+ Received  + 1

  Object {
    "columns": 4,
    "h": 1,

[Killed] EqualityOperator
lib/board-layout.ts:198:9
   });
 
   for (const game of games) {
-    if (game.id === pinnedGameId) continue;
+    if (game.id !== pinnedGameId) continue;
     const span = getEffectiveCardSpan(game, columns);
     const w = Math.min(span.w, columns);
killedBy: useGames moveGameToBoardTarget pins card at requested coordinates
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
    "h": 1,

[Killed] EqualityOperator
lib/board-layout.ts:207:32
     let placed = false;
 
     while (!placed) {
-      for (let candidateX = 0; candidateX <= columns - w; candidateX += 1) {
+      for (let candidateX = 0; candidateX < columns - w; candidateX += 1) {
         if (isFree(candidateX, y, w, span.h)) {
           x = candidateX;
killedBy: useGames moveGameToBoardTarget reflows neighbors deterministically around the pinned target
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
    "h": 1,

[Timeout] BlockStatement
lib/board-layout.ts:208:47
 
     while (!placed) {
       for (let candidateX = 0; candidateX <= columns - w; candidateX += 1) {
-        if (isFree(candidateX, y, w, span.h)) {
-          x = candidateX;
-          placed = true;
-          break;
-        }
+        if (isFree(candidateX, y, w, span.h)) {}
       }
       if (!placed) y += 1;

[Killed] ArrowFunction
lib/board-layout.ts:221:20
     placements.set(game.id, { x, y, w, h: span.h, columns });
   }
 
-  return games.map((game) => ({
-    ...game,
-    board: placements.get(game.id) ?? game.board,
-  }));
+  return games.map(() => undefined);
 }
 
killedBy: useGames moveGameToBoardTarget pins card at requested coordinates
statusReason: TypeError: Cannot read properties of undefined (reading 'status')

[Killed] LogicalOperator
lib/board-layout.ts:223:12
 
   return games.map((game) => ({
     ...game,
-    board: placements.get(game.id) ?? game.board,
+    board: placements.get(game.id) && game.board,
   }));
 }
killedBy: useGames moveGameToBoardTarget pins card at requested coordinates
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
    "columns": 4,
    "h": 1,

[Killed] ArrowFunction
lib/board-layout.ts:237:37
   insertionIndex: number;
   target: { x: number; y: number; w: number; h: number };
 } {
-  const movingOriginal = games.find((game) => game.id === gameId);
+  const movingOriginal = games.find(() => undefined);
   if (!movingOriginal) {
     return {
killedBy: board-layout produces a valid target for wide postcard in lower board rows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
lib/board-layout.ts:237:47
   insertionIndex: number;
   target: { x: number; y: number; w: number; h: number };
 } {
-  const movingOriginal = games.find((game) => game.id === gameId);
+  const movingOriginal = games.find((game) => false);
   if (!movingOriginal) {
     return {
killedBy: board-layout produces a valid target for wide postcard in lower board rows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
lib/board-layout.ts:238:7
   target: { x: number; y: number; w: number; h: number };
 } {
   const movingOriginal = games.find((game) => game.id === gameId);
-  if (!movingOriginal) {
+  if (false) {
     return {
       insertionIndex: 0,
killedBy: board-layout returns deterministic fallback when preview is requested for missing game id
statusReason: TypeError: Cannot read properties of undefined (reading 'board')

[Killed] ConditionalExpression
lib/board-layout.ts:238:7
   target: { x: number; y: number; w: number; h: number };
 } {
   const movingOriginal = games.find((game) => game.id === gameId);
-  if (!movingOriginal) {
+  if (true) {
     return {
       insertionIndex: 0,
killedBy: board-layout produces a valid target for wide postcard in lower board rows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ObjectLiteral
lib/board-layout.ts:248:16
   const moving = spanOverride
     ? {
         ...movingOriginal,
-        board: {
-          ...(movingOriginal.board ?? {
-            x: 0,
-            y: 0,
-            columns,
-          }),
-          ...constrainSpanForCard(
-            movingOriginal.ticketType,
-            clampSpan(spanOverride, columns),
-            columns
-          ),
-          columns,
-        },
+        board: {},
       }
     : movingOriginal;
killedBy: board-layout applies span overrides for push/reflow placement
statusReason: Error: expect(received).toMatchObject(expected)

- Expected  - 2
+ Received  + 2

  Object {
-   "h": 2,
-   "w": 2,

[Survived] LogicalOperator
lib/board-layout.ts:249:15
     ? {
         ...movingOriginal,
         board: {
-          ...(movingOriginal.board ?? {
-            x: 0,
-            y: 0,
-            columns,
-          }),
+          ...(movingOriginal.board && {
+  x: 0,
+  y: 0,
+  columns
+}),
           ...constrainSpanForCard(
             movingOriginal.ticketType,

[Killed] ConditionalExpression
lib/board-layout.ts:264:48
       }
     : movingOriginal;
 
-  const withoutMoving = games.filter((game) => game.id !== gameId);
+  const withoutMoving = games.filter((game) => false);
   const clampedIndex = Math.max(0, Math.min(insertionIndex, withoutMoving.length));
   const candidateOrder = [...withoutMoving];
killedBy: board-layout previews insertion at an explicit index for deterministic zone hover
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] MethodExpression
lib/board-layout.ts:264:25
       }
     : movingOriginal;
 
-  const withoutMoving = games.filter((game) => game.id !== gameId);
+  const withoutMoving = games;
   const clampedIndex = Math.max(0, Math.min(insertionIndex, withoutMoving.length));
   const candidateOrder = [...withoutMoving];
killedBy: board-layout clamps preview insertion index and applies span overrides without existing board
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 5

[Killed] MethodExpression
lib/board-layout.ts:265:24
     : movingOriginal;
 
   const withoutMoving = games.filter((game) => game.id !== gameId);
-  const clampedIndex = Math.max(0, Math.min(insertionIndex, withoutMoving.length));
+  const clampedIndex = Math.min(0, Math.min(insertionIndex, withoutMoving.length));
   const candidateOrder = [...withoutMoving];
   candidateOrder.splice(clampedIndex, 0, moving);
killedBy: board-layout previews insertion at an explicit index for deterministic zone hover
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] MethodExpression
lib/board-layout.ts:265:36
     : movingOriginal;
 
   const withoutMoving = games.filter((game) => game.id !== gameId);
-  const clampedIndex = Math.max(0, Math.min(insertionIndex, withoutMoving.length));
+  const clampedIndex = Math.max(0, Math.max(insertionIndex, withoutMoving.length));
   const candidateOrder = [...withoutMoving];
   candidateOrder.splice(clampedIndex, 0, moving);
killedBy: board-layout findBestInsertion can move polaroid card to top-left
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4

[Killed] ArrayDeclaration
lib/board-layout.ts:266:26
 
   const withoutMoving = games.filter((game) => game.id !== gameId);
   const clampedIndex = Math.max(0, Math.min(insertionIndex, withoutMoving.length));
-  const candidateOrder = [...withoutMoving];
+  const candidateOrder = [];
   candidateOrder.splice(clampedIndex, 0, moving);
   const laidOut = applyBoardLayout(candidateOrder, columns);
killedBy: board-layout chooses a deterministic insertion index for symmetric placements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ConditionalExpression
lib/board-layout.ts:269:41
   const candidateOrder = [...withoutMoving];
   candidateOrder.splice(clampedIndex, 0, moving);
   const laidOut = applyBoardLayout(candidateOrder, columns);
-  const placed = laidOut.find((game) => game.id === gameId);
+  const placed = laidOut.find((game) => false);
   const board = placed?.board ?? { x: 0, y: 0, w: 1, h: 1, columns };
 
killedBy: board-layout produces a valid target for wide postcard in lower board rows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] EqualityOperator
lib/board-layout.ts:269:41
   const candidateOrder = [...withoutMoving];
   candidateOrder.splice(clampedIndex, 0, moving);
   const laidOut = applyBoardLayout(candidateOrder, columns);
-  const placed = laidOut.find((game) => game.id === gameId);
+  const placed = laidOut.find((game) => game.id !== gameId);
   const board = placed?.board ?? { x: 0, y: 0, w: 1, h: 1, columns };
 
killedBy: board-layout findBestInsertion can move polaroid card to top-left
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] OptionalChaining
lib/board-layout.ts:270:17
   candidateOrder.splice(clampedIndex, 0, moving);
   const laidOut = applyBoardLayout(candidateOrder, columns);
   const placed = laidOut.find((game) => game.id === gameId);
-  const board = placed?.board ?? { x: 0, y: 0, w: 1, h: 1, columns };
+  const board = placed.board ?? { x: 0, y: 0, w: 1, h: 1, columns };
 
   return {
killedBy: board-layout falls back to a default preview target when moving id mutates during layout
statusReason: TypeError: Cannot read properties of undefined (reading 'board')

[Killed] LogicalOperator
lib/board-layout.ts:270:17
   candidateOrder.splice(clampedIndex, 0, moving);
   const laidOut = applyBoardLayout(candidateOrder, columns);
   const placed = laidOut.find((game) => game.id === gameId);
-  const board = placed?.board ?? { x: 0, y: 0, w: 1, h: 1, columns };
+  const board = placed?.board && {
+  x: 0,
+  y: 0,
+  w: 1,
+  h: 1,
+  columns
+};
 
   return {
killedBy: board-layout produces a valid target for wide postcard in lower board rows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] EqualityOperator
lib/board-layout.ts:289:47
   insertionIndex: number;
   target: { x: number; y: number; w: number; h: number };
 } {
-  const movingOriginal = games.find((game) => game.id === gameId);
+  const movingOriginal = games.find((game) => game.id !== gameId);
   if (!movingOriginal) {
     return {
killedBy: board-layout returns deterministic fallback when best insertion is requested for missing id
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 0
+ Received  + 2

@@ -1,7 +1,9 @@
  Object {
+   "distance": 2,

[Killed] BooleanLiteral
lib/board-layout.ts:290:7
   target: { x: number; y: number; w: number; h: number };
 } {
   const movingOriginal = games.find((game) => game.id === gameId);
-  if (!movingOriginal) {
+  if (movingOriginal) {
     return {
       insertionIndex: 0,
killedBy: board-layout produces a valid target for wide postcard in lower board rows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Survived] ObjectLiteral
lib/board-layout.ts:300:39
     ? {
         ...movingOriginal,
         board: {
-          ...(movingOriginal.board ?? {
-            x: 0,
-            y: 0,
-            columns,
-          }),
+          ...(movingOriginal.board ?? {}),
           ...constrainSpanForCard(
             movingOriginal.ticketType,

[Killed] ConditionalExpression
lib/board-layout.ts:314:48
         },
       }
     : movingOriginal;
-  const withoutMoving = games.filter((game) => game.id !== gameId);
+  const withoutMoving = games.filter((game) => false);
   const desiredW = moving.board?.w ?? 1;
   const desiredH = moving.board?.h ?? 1;
killedBy: board-layout chooses a deterministic insertion index for symmetric placements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] ArrowFunction
lib/board-layout.ts:314:38
         },
       }
     : movingOriginal;
-  const withoutMoving = games.filter((game) => game.id !== gameId);
+  const withoutMoving = games.filter(() => undefined);
   const desiredW = moving.board?.w ?? 1;
   const desiredH = moving.board?.h ?? 1;
killedBy: board-layout chooses a deterministic insertion index for symmetric placements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] OptionalChaining
lib/board-layout.ts:315:20
       }
     : movingOriginal;
   const withoutMoving = games.filter((game) => game.id !== gameId);
-  const desiredW = moving.board?.w ?? 1;
+  const desiredW = moving.board.w ?? 1;
   const desiredH = moving.board?.h ?? 1;
 
killedBy: board-layout uses default desired span when card has no board
statusReason: TypeError: Cannot read properties of undefined (reading 'w')

[Survived] LogicalOperator
lib/board-layout.ts:315:20
       }
     : movingOriginal;
   const withoutMoving = games.filter((game) => game.id !== gameId);
-  const desiredW = moving.board?.w ?? 1;
+  const desiredW = moving.board?.w && 1;
   const desiredH = moving.board?.h ?? 1;
 

[Killed] OptionalChaining
lib/board-layout.ts:316:20
     : movingOriginal;
   const withoutMoving = games.filter((game) => game.id !== gameId);
   const desiredW = moving.board?.w ?? 1;
-  const desiredH = moving.board?.h ?? 1;
+  const desiredH = moving.board.h ?? 1;
 
   const getOverlapArea = (
killedBy: board-layout uses default desired span when card has no board
statusReason: TypeError: Cannot read properties of undefined (reading 'h')

[Survived] LogicalOperator
lib/board-layout.ts:316:20
     : movingOriginal;
   const withoutMoving = games.filter((game) => game.id !== gameId);
   const desiredW = moving.board?.w ?? 1;
-  const desiredH = moving.board?.h ?? 1;
+  const desiredH = moving.board?.h && 1;
 
   const getOverlapArea = (

[Survived] BlockStatement
lib/board-layout.ts:321:16
   const getOverlapArea = (
     a: { x: number; y: number; w: number; h: number },
     b: { x: number; y: number; w: number; h: number }
-  ): number => {
-    const left = Math.max(a.x, b.x);
-    const top = Math.max(a.y, b.y);
-    const right = Math.min(a.x + a.w, b.x + b.w);
-    const bottom = Math.min(a.y + a.h, b.y + b.h);
-    if (right <= left || bottom <= top) return 0;
-    return (right - left) * (bottom - top);
-  };
+  ): number => {};
 
   const desiredRect = { x: desiredX, y: desiredY, w: desiredW, h: desiredH };

[Survived] MethodExpression
lib/board-layout.ts:322:18
     a: { x: number; y: number; w: number; h: number },
     b: { x: number; y: number; w: number; h: number }
   ): number => {
-    const left = Math.max(a.x, b.x);
+    const left = Math.min(a.x, b.x);
     const top = Math.max(a.y, b.y);
     const right = Math.min(a.x + a.w, b.x + b.w);

[Survived] MethodExpression
lib/board-layout.ts:323:17
     b: { x: number; y: number; w: number; h: number }
   ): number => {
     const left = Math.max(a.x, b.x);
-    const top = Math.max(a.y, b.y);
+    const top = Math.min(a.y, b.y);
     const right = Math.min(a.x + a.w, b.x + b.w);
     const bottom = Math.min(a.y + a.h, b.y + b.h);

[Survived] ArithmeticOperator
lib/board-layout.ts:324:28
   ): number => {
     const left = Math.max(a.x, b.x);
     const top = Math.max(a.y, b.y);
-    const right = Math.min(a.x + a.w, b.x + b.w);
+    const right = Math.min(a.x - a.w, b.x + b.w);
     const bottom = Math.min(a.y + a.h, b.y + b.h);
     if (right <= left || bottom <= top) return 0;

[Survived] MethodExpression
lib/board-layout.ts:324:19
   ): number => {
     const left = Math.max(a.x, b.x);
     const top = Math.max(a.y, b.y);
-    const right = Math.min(a.x + a.w, b.x + b.w);
+    const right = Math.max(a.x + a.w, b.x + b.w);
     const bottom = Math.min(a.y + a.h, b.y + b.h);
     if (right <= left || bottom <= top) return 0;

[Survived] ArithmeticOperator
lib/board-layout.ts:325:40
     const left = Math.max(a.x, b.x);
     const top = Math.max(a.y, b.y);
     const right = Math.min(a.x + a.w, b.x + b.w);
-    const bottom = Math.min(a.y + a.h, b.y + b.h);
+    const bottom = Math.min(a.y + a.h, b.y - b.h);
     if (right <= left || bottom <= top) return 0;
     return (right - left) * (bottom - top);

[Survived] MethodExpression
lib/board-layout.ts:325:20
     const left = Math.max(a.x, b.x);
     const top = Math.max(a.y, b.y);
     const right = Math.min(a.x + a.w, b.x + b.w);
-    const bottom = Math.min(a.y + a.h, b.y + b.h);
+    const bottom = Math.max(a.y + a.h, b.y + b.h);
     if (right <= left || bottom <= top) return 0;
     return (right - left) * (bottom - top);

[Survived] ConditionalExpression
lib/board-layout.ts:326:9
     const top = Math.max(a.y, b.y);
     const right = Math.min(a.x + a.w, b.x + b.w);
     const bottom = Math.min(a.y + a.h, b.y + b.h);
-    if (right <= left || bottom <= top) return 0;
+    if (false) return 0;
     return (right - left) * (bottom - top);
   };

[Survived] ConditionalExpression
lib/board-layout.ts:326:9
     const top = Math.max(a.y, b.y);
     const right = Math.min(a.x + a.w, b.x + b.w);
     const bottom = Math.min(a.y + a.h, b.y + b.h);
-    if (right <= left || bottom <= top) return 0;
+    if (false || bottom <= top) return 0;
     return (right - left) * (bottom - top);
   };

[Killed] ArithmeticOperator
lib/board-layout.ts:327:13
     const right = Math.min(a.x + a.w, b.x + b.w);
     const bottom = Math.min(a.y + a.h, b.y + b.h);
     if (right <= left || bottom <= top) return 0;
-    return (right - left) * (bottom - top);
+    return (right + left) * (bottom - top);
   };
 
killedBy: board-layout findBestInsertion can move postcard card to top-left
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 1

[Killed] ArithmeticOperator
lib/board-layout.ts:327:30
     const right = Math.min(a.x + a.w, b.x + b.w);
     const bottom = Math.min(a.y + a.h, b.y + b.h);
     if (right <= left || bottom <= top) return 0;
-    return (right - left) * (bottom - top);
+    return (right - left) * (bottom + top);
   };
 
killedBy: board-layout applies span overrides for push/reflow placement
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 2

[Killed] EqualityOperator
lib/board-layout.ts:338:32
     target: { x: number; y: number; w: number; h: number };
   } | null = null;
 
-  for (let insertionIndex = 0; insertionIndex <= withoutMoving.length; insertionIndex += 1) {
+  for (let insertionIndex = 0; insertionIndex > withoutMoving.length; insertionIndex += 1) {
     const preview = previewInsertionAtIndex(
       games,
killedBy: board-layout produces a valid target for wide postcard in lower board rows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1
