[Killed] ConditionalExpression
lib/board-layout.ts:338:32
     target: { x: number; y: number; w: number; h: number };
   } | null = null;
 
-  for (let insertionIndex = 0; insertionIndex <= withoutMoving.length; insertionIndex += 1) {
+  for (let insertionIndex = 0; false; insertionIndex += 1) {
     const preview = previewInsertionAtIndex(
       games,
killedBy: board-layout produces a valid target for wide postcard in lower board rows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ObjectLiteral
lib/board-layout.ts:347:24
       spanOverride
     );
     const board = preview.target;
-    const targetRect = { x: board.x, y: board.y, w: board.w, h: board.h };
+    const targetRect = {};
     const overlap = getOverlapArea(desiredRect, targetRect);
     const distance =
killedBy: board-layout chooses a deterministic insertion index for symmetric placements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Survived] ArithmeticOperator
lib/board-layout.ts:350:27
     const targetRect = { x: board.x, y: board.y, w: board.w, h: board.h };
     const overlap = getOverlapArea(desiredRect, targetRect);
     const distance =
-      Math.abs(desiredX + desiredW / 2 - (board.x + board.w / 2)) +
+      Math.abs(desiredX + desiredW * 2 - (board.x + board.w / 2)) +
       Math.abs(desiredY + desiredH / 2 - (board.y + board.h / 2));
 

[Survived] ArithmeticOperator
lib/board-layout.ts:350:7
     const targetRect = { x: board.x, y: board.y, w: board.w, h: board.h };
     const overlap = getOverlapArea(desiredRect, targetRect);
     const distance =
-      Math.abs(desiredX + desiredW / 2 - (board.x + board.w / 2)) +
-      Math.abs(desiredY + desiredH / 2 - (board.y + board.h / 2));
+      Math.abs(desiredX + desiredW / 2 - (board.x + board.w / 2)) - Math.abs(desiredY + desiredH / 2 - (board.y + board.h / 2));
 
     if (

[Survived] ArithmeticOperator
lib/board-layout.ts:351:16
     const overlap = getOverlapArea(desiredRect, targetRect);
     const distance =
       Math.abs(desiredX + desiredW / 2 - (board.x + board.w / 2)) +
-      Math.abs(desiredY + desiredH / 2 - (board.y + board.h / 2));
+      Math.abs(desiredY + desiredH / 2 + (board.y + board.h / 2));
 
     if (

[Survived] ArithmeticOperator
lib/board-layout.ts:351:53
     const overlap = getOverlapArea(desiredRect, targetRect);
     const distance =
       Math.abs(desiredX + desiredW / 2 - (board.x + board.w / 2)) +
-      Math.abs(desiredY + desiredH / 2 - (board.y + board.h / 2));
+      Math.abs(desiredY + desiredH / 2 - (board.y + board.h * 2));
 
     if (

[Killed] ConditionalExpression
lib/board-layout.ts:354:7
       Math.abs(desiredY + desiredH / 2 - (board.y + board.h / 2));
 
     if (
-      !best ||
-      overlap > best.overlap ||
-      (overlap === best.overlap && distance < best.distance) ||
-      (overlap === best.overlap &&
-        distance === best.distance &&
-        insertionIndex < best.insertionIndex)
+      false
     ) {
       best = {
killedBy: board-layout produces a valid target for wide postcard in lower board rows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ConditionalExpression
lib/board-layout.ts:354:7
       Math.abs(desiredY + desiredH / 2 - (board.y + board.h / 2));
 
     if (
-      !best ||
-      overlap > best.overlap ||
-      (overlap === best.overlap && distance < best.distance) ||
+      false ||
       (overlap === best.overlap &&
         distance === best.distance &&
killedBy: board-layout findBestInsertion can move polaroid card to top-left
statusReason: TypeError: Cannot read properties of null (reading 'overlap')

[Killed] ConditionalExpression
lib/board-layout.ts:355:7
 
     if (
       !best ||
-      overlap > best.overlap ||
+      false ||
       (overlap === best.overlap && distance < best.distance) ||
       (overlap === best.overlap &&
killedBy: board-layout chooses a deterministic insertion index for symmetric placements
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 0

[Killed] EqualityOperator
lib/board-layout.ts:355:7
 
     if (
       !best ||
-      overlap > best.overlap ||
+      overlap <= best.overlap ||
       (overlap === best.overlap && distance < best.distance) ||
       (overlap === best.overlap &&
killedBy: board-layout findBestInsertion can move polaroid card to top-left
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: 4

[Survived] LogicalOperator
lib/board-layout.ts:356:8
     if (
       !best ||
       overlap > best.overlap ||
-      (overlap === best.overlap && distance < best.distance) ||
+      (overlap === best.overlap || distance < best.distance) ||
       (overlap === best.overlap &&
         distance === best.distance &&

[Survived] EqualityOperator
lib/board-layout.ts:356:8
     if (
       !best ||
       overlap > best.overlap ||
-      (overlap === best.overlap && distance < best.distance) ||
+      (overlap !== best.overlap && distance < best.distance) ||
       (overlap === best.overlap &&
         distance === best.distance &&

[Survived] ConditionalExpression
lib/board-layout.ts:357:8
       !best ||
       overlap > best.overlap ||
       (overlap === best.overlap && distance < best.distance) ||
-      (overlap === best.overlap &&
-        distance === best.distance &&
-        insertionIndex < best.insertionIndex)
+      (false)
     ) {
       best = {

[Survived] LogicalOperator
lib/board-layout.ts:357:8
       !best ||
       overlap > best.overlap ||
       (overlap === best.overlap && distance < best.distance) ||
-      (overlap === best.overlap &&
-        distance === best.distance &&
-        insertionIndex < best.insertionIndex)
+      (overlap === best.overlap && distance === best.distance || insertionIndex < best.insertionIndex)
     ) {
       best = {

[Survived] ConditionalExpression
lib/board-layout.ts:358:9
       overlap > best.overlap ||
       (overlap === best.overlap && distance < best.distance) ||
       (overlap === best.overlap &&
-        distance === best.distance &&
+        true &&
         insertionIndex < best.insertionIndex)
     ) {

[Survived] EqualityOperator
lib/board-layout.ts:358:9
       overlap > best.overlap ||
       (overlap === best.overlap && distance < best.distance) ||
       (overlap === best.overlap &&
-        distance === best.distance &&
+        distance !== best.distance &&
         insertionIndex < best.insertionIndex)
     ) {

[Survived] ConditionalExpression
lib/board-layout.ts:359:9
       (overlap === best.overlap && distance < best.distance) ||
       (overlap === best.overlap &&
         distance === best.distance &&
-        insertionIndex < best.insertionIndex)
+        true)
     ) {
       best = {

[Survived] EqualityOperator
lib/board-layout.ts:359:9
       (overlap === best.overlap && distance < best.distance) ||
       (overlap === best.overlap &&
         distance === best.distance &&
-        insertionIndex < best.insertionIndex)
+        insertionIndex <= best.insertionIndex)
     ) {
       best = {

[Killed] BlockStatement
lib/board-layout.ts:360:7
       (overlap === best.overlap &&
         distance === best.distance &&
         insertionIndex < best.insertionIndex)
-    ) {
-      best = {
-        insertionIndex: preview.insertionIndex,
-        distance,
-        overlap,
-        target: { x: board.x, y: board.y, w: board.w, h: board.h },
-      };
-    }
+    ) {}
   }
 
killedBy: board-layout produces a valid target for wide postcard in lower board rows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ObjectLiteral
lib/board-layout.ts:365:17
         insertionIndex: preview.insertionIndex,
         distance,
         overlap,
-        target: { x: board.x, y: board.y, w: board.w, h: board.h },
+        target: {},
       };
     }
killedBy: board-layout findBestInsertion can move polaroid card to top-left
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 0
Received: undefined

[Killed] LogicalOperator
lib/board-layout.ts:371:5
   }
 
   return (
-    best ?? {
-      insertionIndex: 0,
-      target: { x: 0, y: 0, w: 1, h: 1 },
-    }
+    best && {
+  insertionIndex: 0,
+  target: {
+    x: 0,
+    y: 0,
+    w: 1,
+    h: 1
+  }
+}
   );
 }
killedBy: board-layout produces a valid target for wide postcard in lower board rows
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 1

[Killed] ObjectLiteral
lib/board-layout.ts:371:13
   }
 
   return (
-    best ?? {
-      insertionIndex: 0,
-      target: { x: 0, y: 0, w: 1, h: 1 },
-    }
+    best ?? {}
   );
 }
killedBy: board-layout returns the defensive fallback when candidate scan loop cannot run
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 9
+ Received  + 1

- Object {
-   "insertionIndex": 0,
-   "target": Object {

[Killed] ObjectLiteral
lib/board-layout.ts:373:15
   return (
     best ?? {
       insertionIndex: 0,
-      target: { x: 0, y: 0, w: 1, h: 1 },
+      target: {},
     }
   );
killedBy: board-layout returns the defensive fallback when candidate scan loop cannot run
statusReason: Error: expect(received).toEqual(expected) // deep equality

- Expected  - 6
+ Received  + 1

  Object {
    "insertionIndex": 0,
-   "target": Object {

[Killed] BlockStatement
lib/board-layout.ts:382:11
   pointer: number,
   stride: number,
   maxSpan: number = 4
-): number {
-  if (stride <= 0) return 1;
-  const normalized = pointer / stride;
-  const distanceToLine = Math.abs(normalized - Math.round(normalized));
-  const cap = Math.max(1, Math.min(maxSpan, 4));
-
-  if (distanceToLine <= 0.015 && cap >= 4) return 4;
-  if (distanceToLine <= 0.035 && cap >= 3) return 3;
-  if (distanceToLine <= 0.075 && cap >= 2) return 2;
-  return 1;
-}
+): number {}
 
 export function getHoverZone(
killedBy: board-layout clamps axis intent span by configured cap
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: undefined

[Killed] ConditionalExpression
lib/board-layout.ts:383:7
   stride: number,
   maxSpan: number = 4
 ): number {
-  if (stride <= 0) return 1;
+  if (true) return 1;
   const normalized = pointer / stride;
   const distanceToLine = Math.abs(normalized - Math.round(normalized));
killedBy: board-layout clamps axis intent span by configured cap
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 1

[Killed] EqualityOperator
lib/board-layout.ts:383:7
   stride: number,
   maxSpan: number = 4
 ): number {
-  if (stride <= 0) return 1;
+  if (stride > 0) return 1;
   const normalized = pointer / stride;
   const distanceToLine = Math.abs(normalized - Math.round(normalized));
killedBy: board-layout clamps axis intent span by configured cap
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 1

[Killed] ArithmeticOperator
lib/board-layout.ts:384:22
   maxSpan: number = 4
 ): number {
   if (stride <= 0) return 1;
-  const normalized = pointer / stride;
+  const normalized = pointer * stride;
   const distanceToLine = Math.abs(normalized - Math.round(normalized));
   const cap = Math.max(1, Math.min(maxSpan, 4));
killedBy: board-layout clamps axis intent span by configured cap
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 4

[Survived] ArithmeticOperator
lib/board-layout.ts:385:35
 ): number {
   if (stride <= 0) return 1;
   const normalized = pointer / stride;
-  const distanceToLine = Math.abs(normalized - Math.round(normalized));
+  const distanceToLine = Math.abs(normalized + Math.round(normalized));
   const cap = Math.max(1, Math.min(maxSpan, 4));
 

[Killed] MethodExpression
lib/board-layout.ts:386:15
   if (stride <= 0) return 1;
   const normalized = pointer / stride;
   const distanceToLine = Math.abs(normalized - Math.round(normalized));
-  const cap = Math.max(1, Math.min(maxSpan, 4));
+  const cap = Math.min(1, Math.min(maxSpan, 4));
 
   if (distanceToLine <= 0.015 && cap >= 4) return 4;
killedBy: board-layout clamps axis intent span by configured cap
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 1

[Killed] MethodExpression
lib/board-layout.ts:386:27
   if (stride <= 0) return 1;
   const normalized = pointer / stride;
   const distanceToLine = Math.abs(normalized - Math.round(normalized));
-  const cap = Math.max(1, Math.min(maxSpan, 4));
+  const cap = Math.max(1, Math.max(maxSpan, 4));
 
   if (distanceToLine <= 0.015 && cap >= 4) return 4;
killedBy: board-layout clamps axis intent span by configured cap
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4

[Killed] LogicalOperator
lib/board-layout.ts:388:7
   const distanceToLine = Math.abs(normalized - Math.round(normalized));
   const cap = Math.max(1, Math.min(maxSpan, 4));
 
-  if (distanceToLine <= 0.015 && cap >= 4) return 4;
+  if (distanceToLine <= 0.015 || cap >= 4) return 4;
   if (distanceToLine <= 0.035 && cap >= 3) return 3;
   if (distanceToLine <= 0.075 && cap >= 2) return 2;
killedBy: board-layout clamps axis intent span by configured cap
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 4

[Killed] ConditionalExpression
lib/board-layout.ts:388:7
   const distanceToLine = Math.abs(normalized - Math.round(normalized));
   const cap = Math.max(1, Math.min(maxSpan, 4));
 
-  if (distanceToLine <= 0.015 && cap >= 4) return 4;
+  if (false) return 4;
   if (distanceToLine <= 0.035 && cap >= 3) return 3;
   if (distanceToLine <= 0.075 && cap >= 2) return 2;
killedBy: board-layout clamps axis intent span by configured cap
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 4
Received: 3

[Killed] EqualityOperator
lib/board-layout.ts:389:34
   const cap = Math.max(1, Math.min(maxSpan, 4));
 
   if (distanceToLine <= 0.015 && cap >= 4) return 4;
-  if (distanceToLine <= 0.035 && cap >= 3) return 3;
+  if (distanceToLine <= 0.035 && cap < 3) return 3;
   if (distanceToLine <= 0.075 && cap >= 2) return 2;
   return 1;
killedBy: board-layout clamps axis intent span by configured cap
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ConditionalExpression
lib/board-layout.ts:389:34
   const cap = Math.max(1, Math.min(maxSpan, 4));
 
   if (distanceToLine <= 0.015 && cap >= 4) return 4;
-  if (distanceToLine <= 0.035 && cap >= 3) return 3;
+  if (distanceToLine <= 0.035 && true) return 3;
   if (distanceToLine <= 0.075 && cap >= 2) return 2;
   return 1;
killedBy: board-layout clamps axis intent span by configured cap
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 2
Received: 3

[Killed] ConditionalExpression
lib/board-layout.ts:390:7
 
   if (distanceToLine <= 0.015 && cap >= 4) return 4;
   if (distanceToLine <= 0.035 && cap >= 3) return 3;
-  if (distanceToLine <= 0.075 && cap >= 2) return 2;
+  if (true) return 2;
   return 1;
 }
killedBy: board-layout clamps axis intent span by configured cap
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] ConditionalExpression
lib/board-layout.ts:390:7
 
   if (distanceToLine <= 0.015 && cap >= 4) return 4;
   if (distanceToLine <= 0.035 && cap >= 3) return 3;
-  if (distanceToLine <= 0.075 && cap >= 2) return 2;
+  if (true && cap >= 2) return 2;
   return 1;
 }
killedBy: board-layout clamps axis intent span by configured cap
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: 1
Received: 2

[Killed] BlockStatement
lib/board-layout.ts:398:14
   normalizedX: number,
   normalizedY: number,
   edgeThreshold: number = 0.22
-): HoverZone {
-  const x = Math.max(0, Math.min(1, normalizedX));
-  const y = Math.max(0, Math.min(1, normalizedY));
-  const edge = Math.max(0.05, Math.min(0.45, edgeThreshold));
-
-  const distances: Array<{ zone: Exclude<HoverZone, "middle">; distance: number }> = [
-    { zone: "left", distance: x },
-    { zone: "right", distance: 1 - x },
-    { zone: "top", distance: y },
-    { zone: "bottom", distance: 1 - y },
-  ];
-  distances.sort((a, b) => a.distance - b.distance);
-  const nearest = distances[0];
-
-  if (nearest.distance <= edge) return nearest.zone;
-  return "middle";
-}
+): HoverZone {}
 
killedBy: board-layout computes edge and middle hover zones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "left"
Received: undefined

[Killed] MethodExpression
lib/board-layout.ts:399:13
   normalizedY: number,
   edgeThreshold: number = 0.22
 ): HoverZone {
-  const x = Math.max(0, Math.min(1, normalizedX));
+  const x = Math.min(0, Math.min(1, normalizedX));
   const y = Math.max(0, Math.min(1, normalizedY));
   const edge = Math.max(0.05, Math.min(0.45, edgeThreshold));
killedBy: board-layout computes edge and middle hover zones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "right"
Received: "left"

[Killed] MethodExpression
lib/board-layout.ts:399:25
   normalizedY: number,
   edgeThreshold: number = 0.22
 ): HoverZone {
-  const x = Math.max(0, Math.min(1, normalizedX));
+  const x = Math.max(0, Math.max(1, normalizedX));
   const y = Math.max(0, Math.min(1, normalizedY));
   const edge = Math.max(0.05, Math.min(0.45, edgeThreshold));
killedBy: board-layout computes edge and middle hover zones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "left"
Received: "right"

[Killed] MethodExpression
lib/board-layout.ts:400:13
   edgeThreshold: number = 0.22
 ): HoverZone {
   const x = Math.max(0, Math.min(1, normalizedX));
-  const y = Math.max(0, Math.min(1, normalizedY));
+  const y = Math.min(0, Math.min(1, normalizedY));
   const edge = Math.max(0.05, Math.min(0.45, edgeThreshold));
 
killedBy: board-layout computes edge and middle hover zones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "left"
Received: "top"

[Killed] MethodExpression
lib/board-layout.ts:400:25
   edgeThreshold: number = 0.22
 ): HoverZone {
   const x = Math.max(0, Math.min(1, normalizedX));
-  const y = Math.max(0, Math.min(1, normalizedY));
+  const y = Math.max(0, Math.max(1, normalizedY));
   const edge = Math.max(0.05, Math.min(0.45, edgeThreshold));
 
killedBy: board-layout computes edge and middle hover zones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "left"
Received: "bottom"

[Survived] MethodExpression
lib/board-layout.ts:401:16
 ): HoverZone {
   const x = Math.max(0, Math.min(1, normalizedX));
   const y = Math.max(0, Math.min(1, normalizedY));
-  const edge = Math.max(0.05, Math.min(0.45, edgeThreshold));
+  const edge = Math.min(0.05, Math.min(0.45, edgeThreshold));
 
   const distances: Array<{ zone: Exclude<HoverZone, "middle">; distance: number }> = [

[Survived] MethodExpression
lib/board-layout.ts:401:31
 ): HoverZone {
   const x = Math.max(0, Math.min(1, normalizedX));
   const y = Math.max(0, Math.min(1, normalizedY));
-  const edge = Math.max(0.05, Math.min(0.45, edgeThreshold));
+  const edge = Math.max(0.05, Math.max(0.45, edgeThreshold));
 
   const distances: Array<{ zone: Exclude<HoverZone, "middle">; distance: number }> = [

[Killed] StringLiteral
lib/board-layout.ts:404:13
   const edge = Math.max(0.05, Math.min(0.45, edgeThreshold));
 
   const distances: Array<{ zone: Exclude<HoverZone, "middle">; distance: number }> = [
-    { zone: "left", distance: x },
+    { zone: "", distance: x },
     { zone: "right", distance: 1 - x },
     { zone: "top", distance: y },
killedBy: board-layout computes edge and middle hover zones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "left"
Received: ""

[Killed] ArithmeticOperator
lib/board-layout.ts:405:32
 
   const distances: Array<{ zone: Exclude<HoverZone, "middle">; distance: number }> = [
     { zone: "left", distance: x },
-    { zone: "right", distance: 1 - x },
+    { zone: "right", distance: 1 + x },
     { zone: "top", distance: y },
     { zone: "bottom", distance: 1 - y },
killedBy: board-layout computes edge and middle hover zones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "right"
Received: "middle"

[Killed] ObjectLiteral
lib/board-layout.ts:405:5
 
   const distances: Array<{ zone: Exclude<HoverZone, "middle">; distance: number }> = [
     { zone: "left", distance: x },
-    { zone: "right", distance: 1 - x },
+    {},
     { zone: "top", distance: y },
     { zone: "bottom", distance: 1 - y },
killedBy: board-layout computes edge and middle hover zones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "right"
Received: "middle"

[Killed] ObjectLiteral
lib/board-layout.ts:406:5
   const distances: Array<{ zone: Exclude<HoverZone, "middle">; distance: number }> = [
     { zone: "left", distance: x },
     { zone: "right", distance: 1 - x },
-    { zone: "top", distance: y },
+    {},
     { zone: "bottom", distance: 1 - y },
   ];
killedBy: board-layout computes edge and middle hover zones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "top"
Received: "middle"

[Killed] ArithmeticOperator
lib/board-layout.ts:407:33
     { zone: "left", distance: x },
     { zone: "right", distance: 1 - x },
     { zone: "top", distance: y },
-    { zone: "bottom", distance: 1 - y },
+    { zone: "bottom", distance: 1 + y },
   ];
   distances.sort((a, b) => a.distance - b.distance);
killedBy: board-layout computes edge and middle hover zones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bottom"
Received: "middle"

[Killed] StringLiteral
lib/board-layout.ts:407:13
     { zone: "left", distance: x },
     { zone: "right", distance: 1 - x },
     { zone: "top", distance: y },
-    { zone: "bottom", distance: 1 - y },
+    { zone: "", distance: 1 - y },
   ];
   distances.sort((a, b) => a.distance - b.distance);
killedBy: board-layout computes edge and middle hover zones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "bottom"
Received: ""

[Killed] ArrowFunction
lib/board-layout.ts:409:18
     { zone: "top", distance: y },
     { zone: "bottom", distance: 1 - y },
   ];
-  distances.sort((a, b) => a.distance - b.distance);
+  distances.sort(() => undefined);
   const nearest = distances[0];
 
killedBy: board-layout computes edge and middle hover zones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "right"
Received: "middle"

[Killed] MethodExpression
lib/board-layout.ts:409:3
     { zone: "top", distance: y },
     { zone: "bottom", distance: 1 - y },
   ];
-  distances.sort((a, b) => a.distance - b.distance);
+  distances;
   const nearest = distances[0];
 
killedBy: board-layout computes edge and middle hover zones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "right"
Received: "middle"

[Killed] ConditionalExpression
lib/board-layout.ts:412:7
   distances.sort((a, b) => a.distance - b.distance);
   const nearest = distances[0];
 
-  if (nearest.distance <= edge) return nearest.zone;
+  if (false) return nearest.zone;
   return "middle";
 }
killedBy: board-layout computes edge and middle hover zones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "left"
Received: "middle"

[Killed] ConditionalExpression
lib/board-layout.ts:412:7
   distances.sort((a, b) => a.distance - b.distance);
   const nearest = distances[0];
 
-  if (nearest.distance <= edge) return nearest.zone;
+  if (true) return nearest.zone;
   return "middle";
 }
killedBy: board-layout computes edge and middle hover zones
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "middle"
Received: "left"
